Repository: nsq974487195/NAND_flash_test_platform
Catalog: FlashcatUSB/languages/*.resx
Languages: chinese, french, german, italian, portuguese, russian, spanish

# settings_seperate
source: Separate
chinese: 分离
french: Séparé
german: Separat
italian: separato
portuguese: Separado
russian: Раздельная
spanish: Separado

# nand_writing_block
source: Writing NAND block {0} of {1} ({2}% complete)
chinese: 写入NAND块{0} of{1}（{2}%完成）
french: Ecriture de block NAND {0} sur {1} ({2}% effectué)
german: Schreibe NAND-Block {0} von {1} ({2}% abgeschlossen)
italian: Scrittura del blocco NAND {0} di {1} ({2}% completato)
portuguese: Escrevendo o bloco NAND {0} de {1} ({2}% completo)
russian: Записывается NAND блок {0} из {1} ({2}% завершено)
spanish: Escribiendo bloque NAND {0} de {1} ({2}% completado)

# nand_completed_with_blocks_left
source: Write image completed with {0} NAND blocks unused
chinese: {0}未用NAND块，完成写入文件
french: Ecriture de l'image terminée avec {0} bloc NAND non utilisés
german: Schreiben des Speicherabbilds mit {0} unbenutzten NAND Blöcken abgeschlossen
italian: Scrivi immagine completata con {0} blocchi NAND inutilizzati
portuguese: Escrever imagem concluída com {0} blocos NAND não utilizados
russian: Запись образа завершена, {0} блоков не исползьовано
spanish: Escritura de imagen completado con {0} bloques NAND sin usar

# nand_missing_block
source: NAND Block missing from image file: {0}
chinese: NAND块丢失：{0}
french: {0} blocks NAND manquant sur le fichier image
german: NAND-Block fehlt in Speicherabbild: {0}
italian: Blocco NAND mancante dal file immagine: {0}
portuguese: NAND Block faltando no arquivo de imagem: {0}
russian: NAND блок отсутствует в файле образа: {0}
spanish: Bloque NAND ausente en el archivo de imagen: {0}

# settings_blk_1stbyte
source: 1st byte:
chinese: 第一个字节：
german: 1. Byte:
italian: 1 ° byte:
portuguese: 1º byte:
russian: 1й байт:
spanish: 1er byte:

# settings_blk_1stpage
source: First spare page
chinese: 第一个备用页面
french: Première page libre
german: Erste Spare Page
italian: Prima pagina di riserva
portuguese: Primeira página
russian: Первая страница
spanish: Primera pág. de reserva

# settings_blk_2ndpage
source: Second spare page
chinese: 第二个备用页面
french: Deuxième page libre
german: Zweite Spare Page
italian: Seconda pagina di riserva
portuguese: Segunda página
russian: Вторая страница
spanish: Segunda pág. de reserva

# settings_blk_6thbyte
source: 6th byte:
chinese: 第6字节
french: 6ème octet:
german: 6. Byte:
italian: Sesto byte:
portuguese: 6º byte:
russian: 6й байт:
spanish: 6to byte:

# settings_blk_enabled
source: Enabled (check for bad block markers)
chinese: 启用（检查所有坏块）
french: Validé (vérifie les marqueurs de mauvais blocs)
german: Aktiviert (auf Bad-Block-Markierungen prüfen)
italian: Abilitato (controllare i marcatori di blocco errati)
portuguese: Ativado (verifique se há marcadores de bloco incorretos)
russian: Включено (проверять маркеры повреждённых блоков)
spanish: Habilitado (verificar si hay huellas de bloques malos)

# settings_blk_lastpage
source: Last spare page
chinese: 最后一个备用页面
french: Dernière page libre
german: Letzte Spare Page
italian: Ultima pagina di riserva
portuguese: Última página
russian: Последняя страница
spanish: Última pág. de reserva

# mem_erase_failed_at
source: Failed to erase Flash at address: 0x{0} (sector index: {1})
chinese: 擦除闪存失败，地址：0x{0}（磁区索引：{1}）
french: Echec de l'effacement de la flash à l'adresse: 0x{0} (sector index: {1})
german: Fehler beim Löschen des Flashs bei Adresse: 0x {0} (Sektorindex: {1})
italian: Impossibile cancellare Flash all'indirizzo: 0x {0} (indice settore: {1})
portuguese: Falha ao apagar o Flash no endereço: 0x{0} (índice do setor: {1})
russian: Ошибка очистки Flash по адресу: 0х{0} (сектор {1})
spanish: Error al borrar Flash en la dirección: 0x{0} (índice del sector: {1})

# mem_erase_failed_title
source: Flash erase failed
chinese: 闪存擦除失败
french: Echec de l'effacement de la flash
german: Löschen des Flashs fehlgeschlagen
italian: La cancellazione del flash non è riuscita
portuguese: O apagamento do flash falhou
russian: Ошибка очистки Flash
spanish: Falló el borrado del flash

# console_eeprom_not_specified
source: The EEPROM device you specified was not found
chinese: 无法找到指定的EEPROM设备
french: The circuit EEPROM que vous avez spécifié n'a pas été trouvé
german: Der angegebene EEPROM wurde nicht gefunden
italian: Il dispositivo EEPROM specificato non è stato trovato
portuguese: O dispositivo EEPROM que você especificou não foi encontrado
russian: Указанное EEPROM устройство не найдено
spanish: El dispositivo EEPROM que especificó no se encontró

# console_erase_not_valid
source: Erase option is only for -WRITE mode
chinese: 删除选项只在编辑模式可用
french: L'option d'effacement n'est valable que pour le mode -WRITE
german: Die Option "Löschen" ist nur im Modus -WRITE verfügbar
italian: L'opzione Cancella è solo per la modalità -WRITE
portuguese: A opção Apagar é apenas para o modo -RARREIRO
russian: Опция очистки только для режима -WRITE
spanish: La opción de borrado es solo para el modo -WRITE

# console_opt_erasechip
source: Erases the entire memory device
chinese: 清除全部数据
french: Efface le circuit mémoire en entier
german: Löscht den gesamten Inhalt des Speicherchips
italian: Cancella l'intero dispositivo di memoria
portuguese: Apaga todo o dispositivo de memória
russian: Полностью очищает устройство памяти
spanish: Borra todo el dispositivo de memoria

# console_opt_not_valid
source: Option not recognized: {0}
chinese: 选项不可识别：{0}
french: Option non reconnue: {0}
german: Unbekannte Option: {0}
italian: Opzione non riconosciuta: {0}
portuguese: Opção não reconhecida: {0}
russian: Неизвестная опция: {0}
spanish: Opción no reconocida: {0}

# console_value_missing
source: You must specify a value following -{0}
chinese: 必须指定一个value following -{0}
french: Vous devez spécifier une valeur suivant -{0}
german: Sie müssen einen Wert für -{0} angeben
italian: Devi specificare un valore che segue - {0}
portuguese: Você deve especificar um valor a seguir - {0}
russian: Укажите значение после -{0}
spanish: Debe especificar un valor siguiendo -{0}

# console_value_numeric_hex
source: -{0} value must be numeric or hexadecimal
chinese: -{0} 值必须是数字或者十六进制
french: la valeur - {0} doit être numérique ou hexadécimale
german: Der Wert für -{0} muss numerisch oder hexadezimal angegeben werden
italian: -Il valore {0} deve essere numerico o esadecimale
portuguese: - {0} o valor deve ser numérico ou hexadecimal
russian: -{0} значение должно быть десятичным или шестнадцатиричным
spanish: El valor -{0} debe ser numérico o hexadecimal

# nandmngr_analyze
source: Analyze
chinese: 分析
french: Analyse
german: Analysieren
italian: Analizza
portuguese: Analisar
russian: Анализировать
spanish: Analizar

# nandmngr_analyzed_done
source: NAND blocks analyzed ({0} bad blocks found)
chinese: NAND坏块分析（找到{0}坏块）
french: Blocks NAND analysés ({0} mauvais blocs trouvés)
german: NAND-Blöcke analysiert ({0} Defekte Blöcke gefunden)
italian: Analisi dei blocchi NAND ({0} blocchi errati trovati)
portuguese: Blocos NAND analisados ​​({0} blocos defeituosos encontrados)
russian: NAND блоки проверены ({0} ошибочных блоков)
spanish: Bloques NAND analizados ({0} bloques malos encontrados)

# nandmngr_bad_block
source: Bad block marker
chinese: 坏块票房
french: Mauvais marqueur de blocs
german: Bad-Block-Markierung
italian: Marcatore blocco errato
portuguese: Marcador de bloco ruim
russian: Неправильный маркер блока
spanish: Marcador de bloque malo

# nandmngr_bad_marker
source: bad marker
chinese: 坏标记
french: mauvai marqueur
german: Bad-Markierung
italian: marcatore errato
portuguese: marcador ruim
russian: Неверный маркер
spanish: marcador malo

# nandmngr_block_map
source: NAND Block Map ({0} total blocks; {1} bytes each)
chinese: NAND块映像（{0}总数；{1}每字节
french: Carte des blocs NAND ({0} total blocs; {1} octets chacun)
german: NAND-Blockaufteilung ({0} Blöcke insgesamt; jeweils {1} Bytes)
italian: Mappa dei blocchi NAND ({0} blocchi totali; {1} byte ciascuno)
portuguese: Mapa de bloco NAND ({0} blocos totais; {1} bytes cada)
russian: Карта блоков NAND (Всего {0} блоков, {1} байт/блок)
spanish: Mapa de Bloque NAND ({0} bloques totales; {1} bytes cada uno)

# nandmngr_close
source: Close
chinese: 关闭
french: Quitter
german: Schließen
italian: Chiudi
portuguese: Fechar
russian: Закрыть
spanish: Cerrar

# nandmngr_confim
source: Confirm operation
chinese: 确认操作
french: Confirmer l’opération
german: Bestätigen Sie den Vorgang
italian: Conferma l'operazione
portuguese: Confirmar operação
russian: Подтвердить операцию
spanish: Confirmar operación

# nandmngr_no_error
source: No error
chinese: 无错误
french: Pas d'Erreur
german: Kein Fehler
italian: Nessun errore
portuguese: Sem erro
russian: Без ошибок
spanish: No hay error

# nandmngr_selected_page
source: Selected page: {0} [block: {1}]
chinese: 选择页面：{0} 【block:{1}]
french: Page sélectionnée: {0} [bloc: {1}]
german: Ausgewählte Page: {0} [Block: {1}]
italian: Pagina selezionata: {0} [blocco: {1}]
portuguese: Página selecionada: {0} [bloco: {1}]
russian: Выбранная страница: {0} [блок: {1}]
spanish: Página seleccionada: {0} [bloque: {1}]

# nandmngr_title
source: NAND Block Management ({0})
chinese: NAND块管理（{0}）
french: Gestion des blocs NAND ({0})
german: NAND-Blockverwaltung ({0})
italian: Gestione dei blocchi NAND ({0})
portuguese: Gerenciamento de bloco NAND ({0})
russian: Управление блоками NAND
spanish: Administración de Bloque NAND ({0})

# nandmngr_user_discarded
source: user discarded
chinese: 用户已丢弃
french: Rejeté par l'utilisateur
german: Vom Benutzer verworfen
italian: utente scartato
portuguese: usuário descartado
russian: Отброшен пользователем
spanish: usuario descartado

# nandmngr_user_marked
source: User marked
chinese: 用户已标记
french: Marqué par l'utilisateur
german: Vom Benutzer markiert
italian: Utente segnato
portuguese: Usuário marcado
russian: Отмечено пользователем
spanish: Usuario marcado

# nandmngr_valid
source: valid
chinese: 可用的
french: Valide
german: Gültig
italian: valido
portuguese: válido
russian: Верный
spanish: válido

# nandmngr_verifing_block
source: Verifying block: {0}
chinese: 块验证：{0}
french: Vérification du bloc: {0}
german: Verifiziere Block: {0}
italian: Blocco di verifica: {0}
portuguese: Bloque de verificação: {0}
russian: Проверка блока: {0}
spanish: Verificando bloque: {0}

# nandmngr_warning
source: Warning, this operation will erase and overwrite all blocks, continue?
chinese: 警告：此项操作将会擦除，并覆盖所有块，继续？
french: Avertissement, cette opération va effacer et réécrire tous les blocs, continuer?
german: Achtung, diese Operation löscht und überschreibt alle Blöcke, wollen Sie fortfahren?
italian: Attenzione, questa operazione cancellerà e sovrascriverà tutti i blocchi, continua?
portuguese: Atenção, esta operação irá apagar e substituir todos os blocos, continuar?
russian: Внимание, эта операция очистит и перезапишет содержимое всех блоков. Продолжить?
spanish: Advertencia, esta operación borrará y sobrescribirá todos los bloques, ¿continuar?

# nandmngr_write_error
source: Write error
chinese: 写入出错
french: Erreur d'écriture
german: Schreibfehler
italian: Scrivi errore
portuguese: Escrever erro
russian: Ошибка записи
spanish: Error de escritura

# nandmngr_write_marker
source: Write BAD BLOCK markers to spare area
chinese: 写入坏块标记到备用区域
french: Ecrire les flags de mauvais blocs dans la zone de réserve
german: Schreibe Bad-Block-Markierungen in den Spare Bereich
italian: Scrivi i marcatori BLOCCO ERRATO nell'area di riserva
portuguese: Escreva marcadores BAD BLOCK para área de reposição
russian: Записать метку BAD BLOCK в запасной сегмент
spanish: Escribir marcadores de BLOQUES MALOS al área de reserva

# mc_mem_converting_format
source: Converting binary file to {0} file format
chinese: 转换二进制文件到{0}文件格式
french: Choisir l'emplacement sur le disque dur et le format de données
german: Konvertiere die Binärdatei in das Dateiformat {0}
italian: Conversione di file binari in formato file {0}
portuguese: Convertendo arquivo binário para o formato de arquivo {0}
russian: Конвертация бинарного файла в формат {0}
spanish: Convirtiendo archivo binario a formato de archivo {0}

# mc_mem_incorrect_format
source: Selected file is not in {0} file format
chinese: 选择的文件不是{0}格式
french: Début de lecture de la mémoire à {0}
german: Die ausgewählte Datei entspricht nicht dem Dateiformat {0}
italian: Il file selezionato non è nel formato di file {0}
portuguese: O arquivo selecionado não está no formato de arquivo {0}
russian: Выбранный файл не в формате {0}
spanish: El archivo seleccionado no está en el formato de archivo {0}

# mc_mem_open_file_write
source: Opened file for writing: {0} ({1}), total file size: {2} bytes
chinese: 已打开的写入文件：{0}（{1}） 总文件大小：{2}字节
french: Opération de lecture annulée
german: Datei zum Schreiben geöffnet: {0} ({1}), Gesamtdateigröße: {2} Bytes
italian: File aperto per scrittura: {0} ({1}), dimensione totale del file: {2} byte
portuguese: Arquivo aberto para escrita: {0} ({1}), tamanho total do arquivo: {2} bytes
russian: Файл открыт для записи: {0}, ({1}), общий размер файла: {2} байт
spanish: Archivo abierto para escritura: {0} ({1}), tamaño total del archivo: {2} bytes

# nandecc_algorithm
source: Algorithm
chinese: 算法
french: Algorithme
german: Algorithmus
italian: Algoritmo
portuguese: Algoritmo
russian: Алгоритм
spanish: Algoritmo

# nandecc_biterror
source: Bit-error
chinese: 误码率
french: Erreur binaire
german: Bitfehler
italian: Errore-bit
portuguese: Erro de bit
russian: Бит-ошибки
spanish: Error-de-bit

# nandecc_changes
source: * Changes take effect on device detect event
chinese: *改变会对设备检测有影响
french: Changements * prennent effet lors d'un événement de détection du circuit
german: * Änderungen werden wirksam, nachdem das Gerät neu verbunden wurde.
italian: * Le modifiche hanno effetto sull'evento di rilevamento del dispositivo
portuguese: As alterações produzem efeito no evento de detecção de dispositivo
russian: * Изменения вступят в силу после переподключения устройства
spanish: * Los cambios toman efecto al detectar el dispositivo

# nandecc_ecclocation
source: ECC location
chinese: ECC位置
french: Emplacement ECC
german: ECC Position
italian: Posizione ECC
portuguese: Localização ECC
russian: Местонахождение ECC
spanish: Ubicación de ECC

# nandecc_enabled
source: Enabled
chinese: 启用
french: Activé
german: Aktiviert
italian: Abilitato
portuguese: Activado
russian: Включено
spanish: Habilitado

# nandecc_read_operation
source: Read operation (auto-correct)
chinese: 读取功能（自动更正）
french: Opération de lecture (auto-correction)
german: Lesevorgang (automatische Korrektur)
italian: Operazione di lettura (auto-corretto)
portuguese: Operação de leitura (auto-correção)
russian: Операция чтения (авто-исправление)
spanish: Operación de lectura (autocorrección)

# nandecc_write_operation
source: Write operation (write ECC)
chinese: 写入功能（写入ECC）
french: Opération d'écriture (Ecriture ECC)
german: Schreibvorgang (ECC schreiben)
italian: Operazione di scrittura (scrivere ECC)
portuguese: Operação de gravação (ECC de gravação)
russian: Операция записи (запись ECC)
spanish: Operación de escritura (escribir ECC)

# nandecc_groupbox
source: Software ECC Feature
chinese: 软件ECC功能
french: Fonction ECC du logiciel
italian: Funzione ECC software
portuguese: Recurso de software ECC
russian: Функция программного ECC
spanish: Característica de software ECC

# nandecc_revbyteorder
source: Reverse byte order
chinese: 反转字节顺序
french: Inverser l'ordre des octets
german: Umgekehrte Byte-Reihenfolge
italian: Ordine dei byte inverso
portuguese: Ordem de byte reverso
russian: Обратный порядок байтов
spanish: Orden de bytes inversa

# nandecc_symwidth
source: Symbol width
chinese: 符号宽度
french: Largeur du symbole
german: Symbolbreite
italian: Larghezza del simbolo
portuguese: Largura do símbolo
russian: Ширина символа
spanish: Ancho del símbolo
