Repository: nsq974487195/NAND_flash_test_platform
Catalog: FlashcatUSB/languages/*.resx
Languages: chinese, french, german, italian, portuguese, russian, spanish

# ext_connected_chipid
source: Connected to Flash (CHIP ID: 0x{0})
chinese: 连接到闪存（芯片ID：0x{0}）
french: Connecté à la Flash (CHIP ID: 0x{0})
german: Verbunden mit Flash (CHIP ID: 0x{0})
italian: Connesso a Flash (ID CHIP: 0x {0})
portuguese: Conectado ao Flash (CHIP ID: 0x{0})
russian: Подключено устройство Flash (CHIP ID: 0x{0})
spanish: Conectado a Flash (ID de CHIP: 0x{0})

# ext_detecting_device
source: Attempting to automatically detect Flash device
chinese: 尝试自动检测闪存设备
french: Tentative de détecter automatiquement la mémoire flash
german: Versuche den Flash-Speicher automatisch zu erkennen
italian: Tentativo di rilevare automaticamente il dispositivo Flash
portuguese: Tentando detectar automaticamente o dispositivo Flash
russian: Попытка автоматического определения Flash устройства
spanish: Intentando detectar automáticamente dispositivo Flash

# ext_device_detected
source: Successfully detected device in {0} mode
chinese: 成功检测设备在{0}模式
french: Circuit détecté avec succès en mode {0}
german: Das Gerät wurde erfolgreich im Modus {0} erkannt
italian: Dispositivo rilevato correttamente in modalità {0}
portuguese: Dispositivo detectado com sucesso no modo {0}
russian: Успешно обнаружено устройство в режиме {0}
spanish: Dispositivo detectado exitosamente en el modo {0}

# ext_device_interface
source: Device interface
chinese: 存储器接口
french: Interface du circuit
german: Geräteschnittstelle
italian: Interfaccia del dispositivo
portuguese: Interface do dispositivo
russian: Интерфейс устройства
spanish: Interfaz del dispositivo

# ext_init
source: Initializing EXT I/O hardware board
chinese: 正在初始化EXT I/O硬件板
french: Initialisation de la carte EXT I/O
german: Initialisiere EXT I/O-Hardwareboard
italian: Inizializzazione della scheda hardware EXT I / O
portuguese: Inicializando placa de hardware EXT I / O
russian: Инициализация EXT I/O платы
spanish: Inicializando la placa de hardware EXT I/O

# ext_large_flash_detected
source: Notice: {0} device detected, Extension Port can only access up to Mb512
chinese: 注意：检测到{0}设备，Extension Port最高可存取512Mb
french: Notification: {0} circuit détecté, Le port d'extension ne peut accéder que jusqu'à 512 Mb
german: Hinweis: {0} Gerät erkannt, Erweiterungsport kann nur auf bis zu 512MB zugreifen
italian: Avviso: {0} dispositivo rilevato, La porta di estensione può accedere solo fino a Mb512
portuguese: Aviso: {0} dispositivo detectado, a porta de extensão só pode acessar até Mb512
russian: Внимание: Обнаружено устройство {0}, Порт Расширения может использовать только до 512Мбит
spanish: Aviso: se detectó dispositivo {0}, el Extension Port solo puede acceder hasta Mb512

# ext_not_detected
source: Flash device not detected in Extension I/O mode
chinese: 未在Extension I/O模式中检测到闪存设备
french: Circuit flash non détecté en mode extension I/O
german: Flash wurde im Modus "Extension I/O" nicht erkannt
italian: Dispositivo flash non rilevato in modalità I / O estensione
portuguese: Dispositivo Flash não detectado no modo Extensão I / O
russian: Flash устройство не обнаружено в режиме Extension I/O
spanish: Dispositivo flash no detectado en el modo de Extension I/O

# ext_page_size
source: Flash page size: {0} bytes ({1} bytes extended)
chinese: 闪存页面大小：{0}字节（扩展{1}字节）
french: Taille des pages flash: {0} octets ({1} octets étendu)
german: Flash Page Größe: {0} Bytes ({1} Bytes erweitert)
italian: Dimensione della pagina Flash: {0} byte ({1} byte estesi)
portuguese: Tamanho da página Flash: {0} bytes ({1} bytes estendidos)
russian: Размер Flash страницы: {0} байт ({1} байт расширенных)
spanish: Tamaño de página Flash: {0} bytes ({1} bytes extendidos)

# ext_prog_mode
source: Programming mode: EXT I/O (Parallel)
chinese: 编辑模式：EXT I/O(并行)
french: Mode de programmation: EXT I/O (Parallèle)
german: Programmiermodus: EXT I/O (Parallel)
italian: Modalità di programmazione: EXT I / O (parallelo)
portuguese: Modo de programação: EXT I / O (Paralelo)
russian: Режим программирования: EXT I/O (параллельный)
spanish: Modo de programación: EXT I/O (Parallel)

# ext_unable_to_connect_to_board
source: Error: unable to connect to EXT I/O board over SPI
chinese: 错误：无法连接到EXT I/O
french: Erreur: impossible de connecter à la carte EXT I/O au travers du SPI
german: Fehler: Verbindung zum EXT I/O Board über SPI nicht möglich
italian: Errore: impossibile connettersi alla scheda I / O EXT su SPI
portuguese: Erro: não é possível conectar-se à placa EXT I / O sobre SPI
russian: Ошибка: невозможно подключиться к плате EXT I/O в режиме SPI
spanish: Error: no se puede conectar a la placa de EXT I/O sobre SPI

# ext_write_mode_supported
source: Write mode supported
chinese: 支持写入模式
french: Mode d'écriture supporté
german: Schreibmodus wird unterstützt
italian: Modalità di scrittura supportata
portuguese: Modo de gravação suportado
russian: Режим записи поддерживается
spanish: Modo de escritura soportada

# flash_detected
source: Flash detected: {0} ({1} bytes)
chinese: 检测到闪存：{0}{1}字节
french: Flash détecté: {0} ({1} octets)
german: Flash erkannt: {0} ({1} Bytes)
italian: Rilevato Flash: {0} ({1} byte)
portuguese: Flash detectado: {0} ({1} bytes)
russian: Обнаружено Flash устройство: {0} ({1} байт)
spanish: Flash detectado: {0} ({1} bytes)

# fw_feat_supported
source: Firmware features supported
chinese: 支持固件功能
french: Fonctionnalités du Firmware supportées
german: Firmware-Funktionen werden unterstützt
italian: Funzionalità del firmware supportate
portuguese: Recursos de firmware suportados
russian: Поддерживаются функции прошивки
spanish: Características de firmware soportada

# fw_out_of_date
source: FlashcatUSB firmware is out of date, please update
chinese: FlashcatUSB固件已过期，请更新
french: Le firmware du FlashcatUSB est périmé, merci de le mettre à jour
german: Die FlashcatUSB Firmware ist veraltet, bitte aktualisieren
italian: Il firmware FlashcatUSB non è aggiornato, si prega di aggiornare
portuguese: O firmware do FlashcatUSB está desactualizado, por favor, atualize
russian: Прошивка FlashcatUSB устарела, пожалуйста обновите
spanish: El firmware FlashcatUSB está desactualizado, por favor actualice

# fw_update_available
source: Firmware update available, performing automatic update
chinese: 有可用更新，执行自动更新
french: Mise à jour du Firmware disponible, mise à jour en cours
german: Firmware-Update verfügbar, automatische Aktualisierung wird durchgeführt
italian: Aggiornamento del firmware disponibile, con aggiornamento automatico
portuguese: Atualização de firmware disponível, realizando atualização automática
russian: Доступно обновление прошивки, выполняется автоматическое обновление
spanish: Actualización de firmware disponible, realizando actualización automática

# fw_update_error
source: Error: failed to start firmware update
chinese: 错误：更新失败
french: Erreur: échec du démarrage de la mise à jour du firmware
german: Fehler: Firmware-Update konnte nicht gestartet werden
italian: Errore: impossibile avviare l'aggiornamento del firmware
portuguese: Erro: não foi possível iniciar a atualização do firmware
russian: Ошибка: сбой обновления прошивки
spanish: Error: no se pudo iniciar la actualización del firmware

# fw_update_performing
source: Performing firmware unit update
chinese: 执行固件单元更新
french: Mise à jour du firmware en cours
german: Firmware-Update wird durchgeführt
italian: Esecuzione dell'aggiornamento dell'unità firmware
portuguese: Atualização da unidade de firmware
russian: Выполняется обновление прошивки
spanish: Realizando la actualización de la unidad de firmware

# fw_update_programming
source: Programming new firmware into FlashcatUSB
chinese: 编辑新的固件到FlashcatUSB Pro
french: Programmation du nouveau firmware dans le FlashcatUSB
german: Programmiere neue Firmware auf FlashcatUSB
italian: Programmazione di nuovo firmware in FlashcatUSB Pro
portuguese: Programação de novo firmware no FlashcatUSB
russian: Программируется новая прошивка в FlashcatUSB
spanish: Programación de firmware nuevo en FlashcatUSB

# fw_update_starting
source: Firmware update starting (sending {0} bytes)
chinese: 更新开始（发送中{0}字节）
french: La mise à jour du firmware démarre (envoie de {0} octets)
german: Firmware-Update wird gestartet (sende {0} Bytes)
italian: Aggiornamento del firmware sta iniziando (invio di {0} byte)
portuguese: Início da atualização do firmware (envio de {0} bytes)
russian: Начало обновления прошивки (отправляется {0} байт)
spanish: Iniciando actualización del firmware (enviando {0} bytes)

# i2c_addr_byte
source: I2C Address byte: 0x{0}
chinese: I2C 字节地址：0x{0}
french: I2C Octet d'adresse: 0x{0}
german: I2C-Adressbyte: 0x{0}
italian: I2C Byte dell'indirizzo: 0x {0}
portuguese: I2C Byte de endereço: 0x{0}
russian: I2C Байты адреса: 0x{0}
spanish: I2C Dirección de byte: 0x{0}

# i2c_attempt_detect
source: Attempting to detect I2C EEPROM device
chinese: 尝试检测I2C EEPROM设备
french: Tentative de détecter le circuit EEPROM I2C
german: Versuche den I2C EEPROM zu erkennen
italian: Tentativo di rilevare il dispositivo EEPROM I2C
portuguese: Tentando detectar o dispositivo I2C EEPROM
russian: Попытка обнаружения I2C EEPROM устройства
spanish: Intentando detectar dispositivo EEPROM I2C

# i2c_connected
source: Successfully connected to I2C EEPROM
chinese: 成功连接I2C EEPROM
french: Connexion réussie avec le circuit EEPROM I2C
german: Erfolgreich mit dem I2C EEPROM verbunden
italian: Collegato correttamente a E2PROM I2C
portuguese: Conectado com sucesso à EEPROM I2C
russian: Успешно обнаружено I2C EEPROM устройство
spanish: Conectado exitosamente a EEPROM I2C

# i2c_detected
source: I2C EEPROM detected and ready for operation
chinese: 已检测到I2C EEPROM，等待操作
french: EEPROM I2C détectée et prête pour les opérations
german: I2C EEPROM erkannt und betriebsbereit
italian: EEPROM I2C rilevata e pronta per l'uso
portuguese: EECOM I2C detectada e pronta para operação
russian: I2C EEPROM устройство обнаружено и готово к работе
spanish: I2C EEPROM detectado y listo para la operación

# i2c_eeprom_size
source: I2C EEPROM device size: {0} bytes
chinese: I2C EEPROM 设备大小：{0}字节
french: Taille du circuit EEPROM I2C: {0} octets
german: I2C EEPROM-Größe: {0} Bytes
italian: Dimensione del dispositivo EEPROM I2C: {0} byte
portuguese: Tamanho do dispositivo I2C EEPROM: {0} bytes
russian: Размер I2C EEPROM устройства: {0} байт
spanish: Tamaño del dispositivo I2C EEPROM: {0} bytes

# i2c_not_detected
source: I2C EEPROM not detected
chinese: 未检测到I2C EEPROM
french: Circuit EEPROM I2C non détecté
german: I2C EEPROM nicht erkannt
italian: EEPROM I2C non rilevata
portuguese: EEPROM I2C não detectada
russian: I2C EEPROM устройство не обнаружено
spanish: I2C EEPROM no detectado

source: I2C protocol speed
chinese: I2C协议速度
french: Vitesse du protocole I2C
german: I2C Protokollgeschwindigkeit
italian: Velocità del protocollo I2C
portuguese: Velocidade do protocolo I2C
russian: Скорость протокола I2C
spanish: Velocidad del protocolo I2C

# i2c_unable_to_connect
source: Unable to connect to I2C EEPROM
chinese: 无法连接到I2C EEPROM
french: Impossible de se connecter à la EEPROM I2C
german: Verbindung zum I2C EEPROM nicht möglich
italian: Impossibile connettersi alla EEPROM I2C
portuguese: Não é possível conectar-se a I2C EEPROM
russian: Невозможно присоединиться к I2C EEPROM
spanish: No se puede conectar a EEPROM I2C

# jtag_cfi_attempt_detect
source: Attempting to detect CFI flash at address 0x{0}
chinese: 尝试检测CFI闪存设备在0x{0}
french: Tentative de détection de la flash CFI flash à l'adresse 0x{0}
german: Versuche den CFI Flash an folgender Adresse zu erkennen: 0x{0}
italian: Tentativo di rilevare il flash CFI all'indirizzo 0x {0}
portuguese: Tentando detectar CFI flash no endereço 0x{0}
russian: Попытка обнаружения CFI flash по адресу 0x{0}
spanish: Intentando detectar el flash CFI en la dirección 0x{0}

# jtag_cfi_no_detect
source: Error: unable to detect CFI flash device over JTAG
chinese: 错误：无法检测CFI闪存设备
french: Erreur: impossible de détecter le circuit flash au travers du JTAG
german: Fehler: Der CFI Flash konnte nicht über JTAG erkannt werden
italian: Errore: impossibile rilevare il dispositivo flash CFI su JTAG
portuguese: Erro: não é possível detectar o dispositivo flash CFI sobre JTAG
russian: Ошибка: невозможно обнаружить CFI flash устройство через JTAG
spanish: Error: no se puede detectar dispositivo flash CFI sobre JTAG

# jtag_dma
source: Target device supports DMA mode
chinese: 目标设备支持DMA模式
french: Le circuit cible est compatible avec le mode DMA
german: Das Zielgerät unterstützt den DMA-Modus
italian: Il dispositivo di destinazione supporta la modalità DMA
portuguese: O dispositivo de destino suporta o modo DMA
russian: Целевое устройство поддерживает режим DMA
spanish: Dispositivo de destino soporta el modo DMA

# jtag_dma_not_supported
source: Error: MCU does not support DMA register access
chinese: 错误：MCU不支持DMA寄存器访问
french: Erreur: Le MCU n'est pas compatible d'un accès DMA aux registres
german: Fehler: Die MCU unterstützt den DMA-Registerzugriff nicht
italian: Errore: MCU non supporta l'accesso al registro DMA
portuguese: Erro: MCU não suporta acesso de registro DMA
russian: Ошибка: микроконтроллер не поддерживает доступ к регистрам через DMA
spanish: Error: MCU no es compatible con el acceso de registro DMA

# jtag_failed_to_connect
source: Failed to connect to target board using JTAG
chinese: JTAG连接目标板失败
french: Echec de la connexion à la carte cible via JTAG
german: Herstellen einer Verbindung zum Zielboard mithilfe von JTAG fehlgeschlagen
italian: Impossibile connettersi alla scheda di destinazione utilizzando JTAG
portuguese: Falha ao conectar-se à placa-alvo usando JTAG
russian: Сбой подключения к целевой плате через JTAG
spanish: No se pudo conectar a la placa de destino utilizando JTAG

# jtag_no_dma
source: Target device does not support DMA mode
chinese: 目标设备不支持DMA模式
french: Circuit cible non compatible du mode DMA
german: Das Zielgerät unterstützt den DMA-Modus nicht
italian: Il dispositivo di destinazione non supporta la modalità DMA
portuguese: O dispositivo de destino não suporta o modo DMA
russian: Целевое устройство не поддерживает режим DMA
spanish: Dispositivo de destino no es compatible con el modo DMA

# jtag_no_idcode
source: Device did not return IDCODE
chinese: 设备没有返回到IDCODE
french: Le circuit ne renvoie pas l' IDCODE
german: Das Gerät hat keinen IDCODE zurückgegeben
italian: Il dispositivo non ha restituito IDCODE
portuguese: O dispositivo não retornou IDCODE
russian: Устройство не вернуло IDCODE
spanish: El dispositivo no devolvió IDCODE

# jtag_ready
source: {0} ready for operation in JTAG mode
chinese: {0}准备在JTAG模式操作
french: {0} prêt pour opérer en mode JTAG
german: {0} bereit für den Betrieb im JTAG-Modus
italian: {0} pronto per l'uso in modalità JTAG
portuguese: {0} pronto para operação no modo JTAG
russian: {0} готово к использованию в режиме JTAG
spanish: {0} listo para funcionar en modo JTAG

# jtag_setup
source: JTAG engine setup successfully
chinese: JTAG引擎设置成功
french: Moteur JTAG configuré avec succès
german: Einrichtung der JTAG-Engine erfolgreich
italian: Configurazione del sistema JTAG con successo
portuguese: Configuração do mecanismo JTAG com sucesso
russian: JTAG окружение успешно запущено
spanish: Configuración exitosa del motor JTAG

# jtag_spi_api_not_loaded
source: Software does not support MCU for SPI operation
chinese: 软件不支持MCU的SPI操作
french: Logiciel non compatible avec MCU pour des opérations SPI
german: Die Software ist nicht kompatibel mit MCU für SPI-Operationen
italian: Il software non supporta MCU per operazioni SPI
portuguese: O software não suporta MCU para operação SPI
russian: Программа не поддерживает режим SPI для микроконтроллера
spanish: El software no apoya a MCU para operación SPI

# jtag_spi_attempt_detect
source: Attempting to detect SPI flash connected to MCU via JTAG
chinese: 尝试检查SPI闪存通过JTAG连接MCU
french: Tentative de détection de la flash CFI flash connectée au MCU au travers du JTAG
german: Versuche SPI-Flash zu erkennen, der über JTAG mit der MCU verbunden ist
italian: Tentativo di rilevare il flash SPI connesso a MCU tramite JTAG
portuguese: Tentando detectar SPI flash conectado a MCU via JTAG
russian: Попытка обнаружить SPI flash подключённые к микроконтроллеру через JTAG
spanish: Intentando detectar SPI flash conectado a MCU a través de JTAG

# jtag_spi_no_detect
source: Error: unable to detect SPI flash device over JTAG
chinese: 错误：无法检测到SPI闪存设备
french: Erreur: Impossible de détecter la flash SPI au travers du JTAG
german: Fehler: SPI-Flash-Gerät konnte nicht über JTAG erkannt werden
italian: Errore: impossibile rilevare il dispositivo flash SPI su JTAG
portuguese: Erro: não é possível detectar o dispositivo flash SPI sobre JTAG
russian: Ошибка: невозможно обнаружить SPI flash устройство через JTAG
spanish: Error: no se pudo detectar dispositivo flash SPI sobre JTAG

# jtag_unknown_device
source: Unknown JTAG device
chinese: 未知JTAG设备
french: Circuit JTAG inconnu
german: Unbekanntes JTAG-Gerät
italian: Dispositivo JTAG sconosciuto
portuguese: Dispositivo JTAG desconhecido
russian: Неизвестное JTAG устройство
spanish: Dispositivo desconocido JTAG

# mem_ask_continue
source: Continue write operation?
chinese: 继续写入？
french: Poursuivre les opérations d'écriture ?
german: Schreibvorgang fortsetzen?
italian: Continuare l'operazione di scrittura?
portuguese: Continuar a operação de gravação?
russian: Продолжить запись?
spanish: Continuar la operación de escritura?

# mem_bad_nand_block
source: BAD NAND BLOCK at page index: 0x{0} (block index: {1})
chinese: 页面索引的NAND坏块：0x{0}（块索引：{1}）
french: Mauvais bloc NAND à la page index: 0x{0} (bloc index: {1})
german: Defekter NAND-Block bei Pageindex: 0x{0} (Blockindex 0x{1})
italian: BLOCCO NAND ERRATO all'indice della pagina: 0x {0} (indirizzo blocco: {1})
portuguese: BAD NAND BLOCK AT endereço: 0x{0}
russian: BAD NAND BLOCK по адресу: 0x{0} (индекс блока: {1})
spanish: BLOQUE NAND MALO en el índice de la página: 0x{0} (índice de bloque: {1})

# mem_erase_device
source: Performing a full chip erase
chinese: 执行擦除全部芯片
french: Effacement complet en cours
german: Vollständiger Löschvorgang des Chips wird durchgeführt
italian: Esecuzione di una cancellazione completa del chip
portuguese: Executando um apagamento completo de fichas
russian: Выполняется полная очистка чипа
spanish: Realizando borrado de chip completo

# mem_erase_device_fail
source: Error: erasing device failed
chinese: 错误：擦除设备失败
french: Erreur: l'effacement du circuit a échoué
german: Fehler: Löschvorgang des Chips fehlgeschlagen
italian: Errore: cancellazione del dispositivo fallita
portuguese: Erro: apagando o dispositivo falhou
russian: Ошибка: сбой очистки устройства
spanish: Error: borrado del dispositivo falló

# mem_erase_device_success
source: Memory device erased successfully
chinese: 成功擦除内存设备
french: Circuit mémoire correctement effacé
german: Speichergerät erfolgreich gelöscht
italian: Il dispositivo di memoria è stato cancellato correttamente
portuguese: Dispositivo de memória apagado com sucesso
russian: Устройство памяти успешно очищено
spanish: Dispositivo de memoria borrado exitosamente

# mem_erasing_sector
source: Erasing memory sector
chinese: 擦除内存扇区
french: Effacement d'un secteur mémoire
german: Lösche Speichersektor
italian: Cancellare il settore della memoria
portuguese: Erupção do setor de memória
russian: Очищается сектор памяти
spanish: Borrando sector de memoria

# mem_flash_supported
source: Flash device successfully detected and ready for operation
chinese: 成功检测闪存设备，准备操作
french: Circuit flash détecté correctement et prêt pour les opérations
german: Flash erfolgreich erkannt und betriebsbereit
italian: Dispositivo Flash rilevato con successo e pronto per l'uso
portuguese: Dispositivo Flash detectado com sucesso e pronto para operação
russian: Flash устройство успешно обнаружено и готово к работе
spanish: Dispositivo flash detectado exitosamente y listo para funcionar

# mem_i2c_error
source: Error communicating with I2C device
chinese: 与I2C设备通信错误
french: Erreur de communication avec le circuit I2C
german: Fehler bei der Kommunikation mit dem I2C-Gerät
italian: Errore di comunicazione con il dispositivo I2C
portuguese: Erro ao se comunicar com o dispositivo I2C
russian: Ошибка соединения с I2C устройством
spanish: Error al comunicarse con dispositivo I2C

# mem_not_supported
source: Flash memory detected but not found in Flash library
chinese: 已检测到闪存，但无法在目录中找到
french: Mémoire flash détectée mais absente de la bibliothèque des circuits
german: Flash-Speicher erkannt, aber nicht in Flash-Bibliothek gefunden
italian: Rilevata memoria flash ma non trovata nella libreria Flash
portuguese: Memória flash detectada, mas não encontrada na biblioteca Flash
russian: Flash устройство обнаружено, но не найдено в библиотеке устройств
spanish: Memoria flash detectada pero no encontrada en la biblioteca Flash

# mem_reading_memory
source: Reading memory of {0} bytes
chinese: 正在读取内存 {0}字节
french: Lecture de {0} octets en mémoire
german: Lese {0} Bytes aus Speicher
italian: Memoria di lettura di {0} byte
portuguese: Memória de leitura de {0} bytes
russian: Считывается {0} байт памяти
spanish: Lectura de memoria de {0} bytes

# mem_verify_data
source: Verifying written data
chinese: 验证写入数据
french: Vérification des données écrites
german: Verifiziere geschriebene Daten
italian: Verifica dei dati scritti
portuguese: Verificando dados escritos
russian: Проверка записанных данных
spanish: Verificando los datos escritos

# mem_verify_failed
source: Data verification failed!
chinese: 数据验证失败
french: Echec de la vérification des données!
german: Datenüberprüfung fehlgeschlagen!
italian: Verifica dei dati fallita!
portuguese: A verificação de dados falhou!
russian: Ошибка проверки данных!
spanish: ¡La verificación de datos falló!

# mem_verify_failed_at
source: Data verification failed at 0x{0}
chinese: 在0x{0]验证数据失败
french: La vérification des données a échouée à 0x{0}
german: Die Datenüberprüfung ist bei 0x{0} fehlgeschlagen
italian: Verifica dei dati fallita a 0x {0}
portuguese: A verificação de dados falhou em 0x{0}
russian: Ошибка проверки данных по адресу 0x{0}
spanish: La verificación de datos falló en 0x{0}

# mem_verify_failed_title
source: Error verification failed
chinese: 错误验证失败
french: Erreur: Echec de la vérification
german: Fehler: Überprüfung fehlgeschlagen
italian: Errore di verifica fallito
portuguese: Falha na verificação de erro
russian: Проверка на ошибки завершилась неуспешно
spanish: Verificación de error falló

# mem_verify_mismatches
source: Address {0}: wrote {1} and read {2} ({3} mismatches)
chinese: 地址{0}：写入{1} 读取{2}（{3}不匹配）
french: Adresse {0}: {1} écrit mais {2} lu ({3} différences)
german: Adresse {0}: {1} geschrieben, aber {2} gelesen ({3} Unterschiede)
italian: Indirizzo {0}: scritto {1} e letto {2} ({3} disallineamenti)
portuguese: Endereço {0}: escreveu {1} e lê {2} ({3} desajustes)
russian: Адрес {0}: записано {1} а считано {2} ({3} несовпадения)
spanish: Dirección {0}: escribió {1} y leyó {2} ({3} no coinciden)

# mem_verify_okay
source: Data verification was successful
chinese: 数据验证成功
french: Succès de la vérification des données
german: Die Datenüberprüfung war erfolgreich
italian: La verifica dei dati ha avuto successo
portuguese: A verificação dos dados foi bem sucedida
russian: Проверка данных выполнена успешно
spanish: La verificación de datos fue exitosa

# mem_write_not_successful
source: Error, write operation was not successful
chinese: 错误：写入不成功
french: Erreur: Echec de l'écriture des données
german: Fehler, Schreibvorgang war nicht erfolgreich
italian: Errore, l'operazione di scrittura non è andata a buon fine
portuguese: Erro, a operação de escrita não foi bem sucedida
russian: Ошибка, операция записи завершилась неуспешно
spanish: Error, la operación de escritura no tuvo éxito
