Repository: nsq974487195/NAND_flash_test_platform
Catalog: FlashcatUSB/languages/*.resx
Languages: chinese, french, german, italian, portuguese, russian, spanish

# gui_gand_erase_all_confirm
source: This will erase all connected Flash devices, are you sure?
chinese: 此项操作将会删除所有已连接的闪存设备，确定执行？
french: Cela va effacer tout le contenu du circuit flash. Confirmez-vous?
german: Dies löscht alle angeschlossenen Flash-Speicher, sind Sie sicher?
italian: Questo cancellerà tutti i dispositivi Flash collegati, sei sicuro?
portuguese: Isso irá apagar todos os dispositivos Flash conectados, você tem certeza?
russian: Вы уверены что хотите стереть все подключённые Flash устройства?
spanish: Esto borrará todos los dispositivos Flash conectados, ¿estás seguro?

# gui_gane_write
source: Write
chinese: 写入
french: Ecriture
german: Schreiben
italian: Scrivi
portuguese: Escreva
russian: Записать
spanish: Escribir

# gui_gang_choose_binary
source: Choose a binary file for programming
chinese: 选择所要编程的二进制文件
french: Choisissez un fichier binaire pour la programmation
german: Wählen Sie eine Binärdatei für die Programmierung
italian: Scegli un file binario per programmare
portuguese: Escolha um arquivo binário para programação
russian: Выбирете бинарный файл для программирования
spanish: Elija un archivo binario para programar

# gui_gang_devices_programmed
source: All Flash devices programmed
chinese: 所有闪存设备已编辑
french: Tous les circuits flash sont programmés
german: Alle Flash-Speicher wurden programmiert
italian: Tutti i dispositivi Flash programmati
portuguese: Todos os dispositivos Flash programados
russian: Все Flash устройства были запрограммированы
spanish: Todos los dispositivos Flash programados

# gui_gang_device_busy
source: One or more devices are busy
chinese: 一个或多个设备正在工作中
french: Un ou plusieurs circuit(s) occupé(s)
german: Ein oder mehrere Geräte sind derzeit beschäftigt
italian: Uno o più dispositivi sono occupati
portuguese: Um ou mais dispositivos estão ocupados
russian: Одно устройство (или более) заняты
spanish: Uno o más dispositivos están ocupados

# gui_gang_erase
source: Erase
chinese: 清除
french: Effacement
german: Löschen
italian: Cancella
portuguese: Apagar
russian: Стереть
spanish: Borrar

# gui_gang_erase_complete
source: All Flash devices erased
chinese: 所有闪存设备已清除
french: Tous les circuits flash sont effacés
german: Alle Flash-Speicher wurden gelöscht
italian: Tutti i dispositivi Flash sono stati cancellati
portuguese: Todos os dispositivos Flash foram apagados
russian: Все Flash устройства были очищены
spanish: Todos los dispositivos Flash borrados

# gui_gang_erasing
source: Erasing all Flash devices
chinese: 正在清除所有闪存设备
french: Effacement de tous les circuits flash
german: Lösche alle Flash-Speicher
italian: Cancellazione di tutti i dispositivi Flash
portuguese: Apagar todos os dispositivos Flash
russian: Очистка всех Flash устройств
spanish: Borrando todos los dispositivos Flash

# gui_gang_info
source: This is the multi-device programmer interface tool
chinese: 这是多设备程序接口工具
french: Ceci est l'interface d'un outil de programmation multi-circuit
german: Dies ist das Interface zur Programmierung mehrerer Geräte
italian: Questo è lo strumento di interfaccia per programmatori multi-dispositivo
portuguese: Esta é a ferramenta de interface do programador multi-dispositivo
russian: Это интерфейс инструмента программирования нескольких устройств
spanish: Esta es la herramienta de interfaz del programador multi-dispositivo

# gui_img_saved_to_disk
source: Flash image saved to disk: {0}
chinese: 闪存文件已经保存到磁盘：{0}
french: Image de la flash enregistrée sur le disque: {0}
german: Flash-Speicherabbild auf Festplatte gespeichert: {0}
italian: Immagine flash salvata sul disco: {0}
portuguese: Imagem instantânea gravada no disco: {0}
russian: Образ Flash сохранён на диск: {0}
spanish: Imagen flash guardada en el disco: {0}

# gui_img_successful
source: Successfully programmed Flash image into current device
chinese: 成功编程闪存文件到当前设备
french: Image de la flash correctement programmée sur le circuit
german: Flash-Speicherabbild wurde erfolgreich auf aktuelles Speichergerät programmiert
italian: Immagine Flash programmata con successo nel dispositivo corrente
portuguese: Imagem Flash Flash programada com sucesso no dispositivo atual
russian: Образ Flash успешно записан на текущее устройство
spanish: La imagen de Flash programada exitosamente en el dispositivo actual

# gui_memory_device
source: Memory device
chinese: 存储设备
french: Circuit mémoire correctement effacé
german: Speichergerät
italian: Dispositivo di memoria
portuguese: Dispositivo de memória
russian: Устройство памяти
spanish: Dispositivo de memoria

# gui_mem_device_status
source: Device {0}: Not Connected
chinese: 设备{0}：未连接
french: Circuit {0}: Non connecté
german: Gerät {0}: Nicht verbunden
italian: Dispositivo {0}: non connesso
portuguese: Dispositivo {0}: Não conectado
russian: Устройство {0}: Отключено
spanish: Dispositivo {0}: no conectado

# gui_mem_size
source: Flash memory size
chinese: 闪存容量
french: Taille de la mémoire flash
german: Flash-Speichergröße
italian: Dimensione della memoria flash
portuguese: Tamanho da memória flash
russian: Размер Flash памяти
spanish: Tamaño de la memoria flash

# gui_menu_language
source: Language
chinese: 语言
french: Langue
german: Sprache
italian: Lingua
portuguese: Língua
russian: Язык
spanish: Idioma

# gui_menu_main
source: Main
chinese: 主菜单
french: Menu Principal
german: Hauptmenü
italian: Principale
portuguese: Principal
russian: Главная
spanish: Principal

# gui_menu_main_detect
source: Detect (re-initialize)
chinese: 检测（重新初始化）
french: Détection (re-initialise)
german: Erkennen (re-/initialisieren)
italian: Rileva (reinizializza)
portuguese: Detectar (reinicializar)
russian: Определить (ре-инициализировать)
spanish: Detectar (re-iniciar)

# gui_menu_main_exit
source: Exit
chinese: 退出
french: Quitter
german: Beenden
italian: Esci
portuguese: Saída
russian: Выход
spanish: Salir

# gui_menu_main_refresh
source: Refresh flash device
chinese: 刷新闪存设备
french: Rafraîchi le circuit flash
german: Flash aktualisieren
italian: Aggiorna dispositivo flash
portuguese: Atualizar dispositivo flash
russian: Обновить flash устройство
spanish: Refrescar dispositivo flash

# gui_menu_main_repeat
source: Repeat write operation
chinese: 重复写入操作
french: Répète l’opération d'écriture
german: Letzte Schreiboperation wiederholen
italian: Ripeti operazione di scrittura
portuguese: Operação de gravação repetida
russian: Повторить запись
spanish: Repetir la operación de escritura

# gui_menu_mode
source: Mode
chinese: 模式
german: Modus
italian: Modalità
portuguese: Modo
russian: Режим
spanish: Modo

# gui_menu_mode_bitswap
source: Bit Swapping
chinese: 位交换
french: Permutation des bits
german: Bit-Wechsel
italian: Scambio bit
portuguese: Troca de bits
russian: Замена битов
spanish: Intercambio de bits

# gui_menu_mode_endian
source: Endian mode
chinese: Endian模式
french: Mode Endian
german: Byte-Reihenfolge
italian: Modalità Endian
portuguese: Modo Endian
russian: Режим Endian
spanish: Modo Endian

# gui_menu_mode_settings
source: Protocol settings
chinese: 协议设备
french: Sélection du protocole
german: Protokolleinstellungen
italian: Impostazioni del protocollo
portuguese: Configurações de protocolo
russian: Настройки протокола
spanish: Ajustes de protocolo

# gui_menu_mode_verify
source: Verify programming
chinese: 验证编程
french: Vérification de la programmation
german: Verifiziere Programmierung
italian: Verifica programma
portuguese: Verifique a programação
russian: Проверка записи
spanish: Verificar la programación

# gui_menu_mode_voltage
source: Voltage ({0})
chinese: 电压（{0}）
french: tension ({0})
german: Spannung ({0})
italian: Voltaggio ({0})
portuguese: Tensão ({0})
russian: Напряжение({0})
spanish: Voltaje ({0})

# gui_menu_mode_vpp
source: VPP Setting
chinese: VPP设备
french: Sélection de VPP
german: VPP-Auswahl
italian: Impostazione VPP
portuguese: Configuração VPP
russian: Настройка VPP
spanish: Configuración de VPP

# gui_menu_script
source: Script
chinese: 脚本
german: Skript
portuguese: Roteiro
russian: Скрипт

# gui_menu_script_load
source: Load script
chinese: 加载脚本
french: Charge un script
german: Lade Skript
italian: Carica script
portuguese: Carregar script
russian: Загрузить скрипт
spanish: Cargar script

# gui_menu_script_select
source: Select script
chinese: 选择脚本
french: Sélectionne un script
german: Wähle Skript
italian: Seleziona script
portuguese: Selecionar script
russian: Выбрать скрипт
spanish: Seleccionar script

# gui_menu_script_unload
source: Unload script
chinese: 停止加载脚本
french: Clôture un script
german: Entlade Skript
italian: Deseleziona script
portuguese: Script de descarregamento
russian: Выгрузить скрипт
spanish: Descargar script

# gui_menu_tools
source: Tools
chinese: 工具
french: Outils
italian: Strumenti
portuguese: Ferramentas
russian: Инструменты
spanish: Herramientas

# gui_menu_tools_create
source: Create image
chinese: 建立文件
french: Crée une image
german: Erstelle Speicherabbild
italian: Crea immagine
portuguese: Criar imagem
russian: Создать образ
spanish: Crear imagen

# gui_menu_tools_erase
source: Erase chip
chinese: 芯片擦除
french: Efface la puce
german: Lösche Chip
italian: Cancella il chip
portuguese: Apagar chip
russian: Стереть чип
spanish: Borrar chip

# gui_menu_tools_mem_map
source: NAND memory map
chinese: NAN内存映像
french: Carte mémoire NAND
german: NAND Speicheraufteilung
italian: Mappa della memoria NAND
portuguese: Mapa de memória NAND
russian: Разметка NAND памяти
spanish: Mapa de memoria NAND

# gui_menu_tools_spi_ecc
source: SPI NAND internal ECC
chinese: SPI NAND 内部 ECC
french: ECC interne SPI NAND
german: SPI NAND interner ECC
italian: ECC interno SPI NAND
portuguese: SPI NAND ECC interno
russian: Встроенный ECC SPI NAND
spanish: SPI NAND interno ECC

# gui_menu_tools_vendor
source: Vendor Features
chinese: 供应商特性
french: Caractéristiques fabriquant
german: Herstellerspezifische Funktionen
italian: Caratteristiche del venditore
portuguese: Características do Vendedor
russian: Свойства производителя
spanish: Características del Proveedor

# gui_menu_tools_write
source: Write image
chinese: 写入文件
french: Ecrit l'image
german: Schreibe Speicherabbild
italian: Scrivi immagine
portuguese: Escreva imagem
russian: Записать образ
spanish: Escribir imagen

# gui_nand_creating_backup
source: Error creating backup: read memory returned inconsistance results
chinese: 建立备份出错：读取内存返回结果不一致
french: Erreur lors de la création du backup: différences dans la mémoire relue
german: Fehler beim Erstellen des Backups: Beim Lesen des Speichers wurden inkonsistente Ergebnisse zurückgegeben
italian: Errore durante la creazione del backup: leggere i risultati di incoerenza restituiti dalla memoria
portuguese: Erro ao criar backup: ler memória retornou resultados inconsistentes
russian: Ошибка создания резервной копии: чтение из памяти вернуло неопределённый результат
spanish: Error al crear una copia de seguridad: la memoria de lectura arroja resultados inconsistentes

# gui_not_valid_img
source: Error: file is not a valid Flash image
chinese: 错误：文件失效
french: Erreur: le fichier n'est pas une image flash valide
german: Fehler: Die Datei ist kein gültiges Flash-Speicherabbild
italian: Errore: il file non è un'immagine Flash valida
portuguese: Erro: o arquivo não é uma imagem Flash válida
russian: Ошибка: файл не является корректным образом Flash
spanish: Error: el archivo no es una imagen Flash válida

# gui_open_img
source: Open Flash image file to program
chinese: 打开要编程的闪存文件
french: Ouvrir le fichier d'image flash à programmer
german: Öffnen Sie das zu programmierende Flash-Speicherabbild
italian: Aprire il file immagine Flash da programmare
portuguese: Abra o arquivo de imagem do Flash para o programa
russian: Открыть файл образа для записи
spanish: Abrir archivo de imagen Flash para programar

# gui_programming_img
source: Programming Flash image: {0}
chinese: 正在编程闪存文件：{0}
french: Programmation de l'image flash: {0}
german: Programmiere Flash-Speicherabbild: {0}
italian: Programmazione dell'immagine Flash: {0}
portuguese: Programação da imagem do Flash: {0}
russian: Запись образа Flash: {0}
spanish: Programando imagen Flash: {0}

# gui_reading_flash
source: Reading Flash: {0} of {1} bytes ({2}% complete)
chinese: 正在读取内存：{0} of {1}字节(完成{2}%）
french: Lecture de la Flash: {0} sur {1} octets ({2}% effectué)
german: Lese Flash: {0} von {1} Bytes ({2}% abgeschlossen)
italian: Lettura Flash: {0} di {1} byte ({2}% completato)
portuguese: Leitura de Flash: {0} de {1} bytes ({2}% concluído)
russian: Считывание Flash: {0} из {1} байт ({2}% завершено)
spanish: Lectura de Flash: {0} de {1} bytes ({2}% completado)

# gui_reading_spare_area
source: Reading NAND spare area: {0} of {1} bytes ({2}% complete)
chinese: 正在读取NAND备用区：{0} of {1} 字节（完成{2}%）
french: Lecture de la zone de réserve NAND: {0} sur {1} octets ({2}% effectué)
german: Lesen des NAND Spare-Bereichs {0} von {1} Bytes ({2}% abgeschlossen)
italian: Lettura dell'area di riserva NAND: {0} di {1} byte ({2}% completato)
portuguese: Leitura da área de reposição NAND: {0} de {1} bytes ({2}% concluído)
russian: Считывание запасной зоны NAND: {0} из {1} байт ({2}% завершено)
spanish: Lectura del área de reserva NAND {0} de {1} bytes ({2}% completado)

# gui_repeat_beginning
source: Performing repeat write operation, resetting device
chinese: 执行重复写入操作，重置设备
french: Nouvelle opération d'écriture, reset du circuit
german: Wiederhole Schreiboperation, Setze Gerät zurück
italian: Esecuzione di operazioni di scrittura ripetute, ripristino del dispositivo
portuguese: Execução de operação de gravação repetida, dispositivo de redefinição
russian: Выполняется повторная запись, сбрасываем устройство
spanish: Realización de operaciones de escritura repetida, resetando dispositivo

# gui_repeat_failed_detect
source: Error, can not detect Flash device to perform repeat operation
chinese: 错误，未检测到闪存设备，无法进行重复操作
french: Erreur, impossible de détecter le circuit flash pour exécuter l'opération répétée
german: Fehler, Flash-Gerät wurde nicht erkannt um den Wiederholungsvorgang auszuführen
italian: Errore, impossibile rilevare il dispositivo Flash per eseguire operazioni di ripetizione
portuguese: Erro, não é possível detectar o dispositivo Flash para executar a operação repetida
russian: Ошибка, невозможно обнаружить Flash устройство для повторной записи
spanish: Error, no se puede detectar dispositivo Flash para realizar una operación de repetición

# gui_repeat_failed_reconnect
source: Error, unable to reconnect to FlashcatUSB
chinese: 错误，无法重新连接到FlashcatUSB
french: Erreur, impossible de se reconnecter au flashcatUSB
german: Fehler, keine Verbindung zu FlashcatUSB möglich
italian: Errore, impossibile riconnettersi a FlashcatUSB
portuguese: Erro, incapaz de se reconectar ao FlashcatUSB
russian: Ошибка, невозможно подключиться к FlashcatUSB
spanish: Error, no se pudo reconectar al FlashcatUSB

# gui_saved_img_to_disk
source: Saved Flash image to disk: {0}
chinese: 保存文件到磁盘：{0}
french: Image flash enregistrée sur le disque: {0}
german: Flash-Speicherabbild wurde auf Festplatte gespeichert: {0}
italian: Immagine Flash salvata su disco: {0}
portuguese: Imagem de Flash guardada no disco: {0}
russian: Образ Flash сохранён на диск: {0}
spanish: Imagen Flash guardada en el disco: {0}

# gui_save_dialog
source: Choose location to save the console log
chinese: 选择存储控制台日志的路径
french: Choisissez un emplacement pour enregistrer le fichier log de la console
german: Wählen Sie den Speicherort zum Speichern des Konsolenprotokolls
italian: Scegli la posizione per salvare il log della console
portuguese: Escolha o local para salvar o log do console
russian: Выбрать место для сохранения лога консоли
spanish: Elija ubicación para guardar el registro de la consola

# gui_script_can_not_load
source: Can not load script, file does not exist
chinese: 无法加载脚本，文件不存在
french: Impossible de charger le script, le fichier n'existe pas
german: Skript kann nicht geladen werden, Datei existiert nicht
italian: Impossibile caricare lo script, il file non esiste
portuguese: Não é possível carregar o script, o arquivo não existe
russian: Невозможно загрузить скрипт, файл не существует
spanish: No se pudo cargar el script, el archivo no existe

# gui_script_checking
source: Checking for a device specific script to automatically load
chinese: 检查设备特定的脚本以自动加载
french: Recherche d'un script spécifique du circuit à charger automatiquement
german: Prüfen, ob ein gerätespezifisches Skript automatisch geladen werden kann
italian: Verifica di uno script specifico per dispositivo da caricare automaticamente
portuguese: Verificando um script específico do dispositivo para carregar automaticamente
russian: Проверка скрипта устройства для автоматической загрузки
spanish: Buscando por un script específico del dispositivo para cargar automáticamente

# gui_script_loaded
source: Loaded script {0} successfully
chinese: 成功加载脚本{0}
french: Script {0} chargé avec succès
german: Skript {0} erfolgreich geladen
italian: Script caricato {0} correttamente
portuguese: Script carregado {0} com sucesso
russian: Скрипт {0} успешно загружен
spanish: Script {0} cargado exitosamente

# gui_script_loading
source: Loading device specific script: {0}
chinese: 加载设备特定脚本：{0}
french: Chargement du script spécifique au circuit: {0}
german: Gerätspezifisches Skript wird geladen: {0}
italian: Caricamento dello script specifico del dispositivo: {0}
portuguese: Carregando o script específico do dispositivo: {0}
russian: Загрузка скрипта устройства: {0}
spanish: Cargando script específico del dispositivo: {0}

# gui_script_non_available
source: No script files available
chinese: 没有脚本文件
french: Pas de fichier script disponible
german: Keine Skriptdateien verfügbar
italian: Nessun file di script disponibile
portuguese: Nenhum arquivo de script disponível
russian: Нет доступных скрипт-файлов
spanish: No hay archivos de script disponibles

# gui_script_open
source: Select FlashcatUSB script file to open
chinese: 打开FlashcatUSB脚本文件
french: Sélectionner le fichier script FlashcatUSB à ouvrir
german: Wählen Sie die zu öffnende FlashcatUSB-Skriptdatei aus
italian: Seleziona il file di script FlashcatUSB da aprire
portuguese: Selecione o arquivo de script FlashcatUSB para abrir
russian: Выбрать скрипт FlashcatUSB для загрузки
spanish: Seleccione el archivo de script FlashcatUSB para abrir

# gui_script_reset
source: The FlashcatUSB script engine has been reset
chinese: FlashcatUSB脚本引擎已被重置
french: L'interpréteur de script FlashcatUSB a été réinitialisé
german: Die FlashcatUSB Skript-Engine wurde zurückgesetzt
italian: Lo script di FlashcatUSB è stato ripristinato
portuguese: O mecanismo do script FlashcatUSB foi reiniciado
russian: Обработчик скриптов FlashcatUSB был перезагружен
spanish: El motor script del FlashcatUSB ha sido resetado

# gui_select_location
source: Select location to save Flash image file
chinese: 选择要保存闪存文件的路径
french: Sélectionner l'endroit où enregistrer l'image flash
german: Wählen Sie den Speicherort für das Flash-Speicherabbild aus
italian: Seleziona la posizione per salvare il file di immagine Flash
portuguese: Selecione o local para salvar o arquivo de imagem do Flash
russian: Выбрать место для сохранения образа Flash
spanish: Seleccione la ubicación para guardar el archivo de imagen Flash

# gui_status_welcome
source: Welcome to FlashcatUSB (SPI / I2C / JTAG Programing Software)!
chinese: 欢迎使用FlashcatUSB(SPI/I2C/JTAG编程软件)
french: Bienvenue sur FlashcatUSB (Logiciel de programmation SPI / I2C / JTAG)!
german: Willkommen zu FlashcatUSB (Der SPI / I2C / JTAG Programmier-Software)!
italian: Benvenuto in FlashcatUSB (software di programmazione SPI / I2C / JTAG)!
portuguese: Bem-vindo ao FlashcatUSB (software de programação SPI / I2C / JTAG)!
russian: Добро пожаловать в FlashcatUSB (ПО для программирования SPI / I2C / JTAG)
spanish: ¡Bienvenido a FlashcatUSB (software de programación SPI / I2C / JTAG)!

# gui_tab_console
source: Console
chinese: 控制台
german: Konsole
italian: Consolle
russian: Консоль
spanish: Consola

# gui_tab_multi
source: Multi-device
chinese: 多功能设备
french: Multi-circuit
italian: Multi-dispositivo
portuguese: Multidispositivo
russian: Мульти-устройство
spanish: Multi-dispositivo

# gui_tab_status
source: Status
chinese: 状态
french: Statut
italian: Stato
russian: Статус
spanish: Estado

# gui_vpp_confirm
source: Are you sure you want to enable this feature?
chinese: 你确定要启用此项功能吗？
french: Etes vous sur que vous voulez activer cette fonction?
german: Möchten Sie diese Funktion wirklich aktivieren?
italian: Sei sicuro di voler abilitare questa funzione?
portuguese: Tem certeza de que deseja ativar esse recurso?
russian: Вы уверены что хотите включить эту настройку?
spanish: ¿Seguro que quieres habilitar esta característica?

# gui_vpp_setting
source: Confirm +12V VPP Setting
chinese: 确认+12V VPP设置
french: Confirmation du paramètre VPP +12V
german: Bestätigen Sie die +12V VPP-Einstellung
italian: Confermare l'impostazione + 12V VPP
portuguese: Confirmar + Configuração VPP de 12V
russian: Подтвердите настройку +12VPP
spanish: Confirmar la configuración de +12V VPP

# gui_vpp_warning
source: Warning, this setting should only be used with adapters with a +12V switch
chinese: 警告！此设置仅用于+12V开关的适配器
french: Attention, de paramètre ne doit être utilisé qu'avec un adaptateur ayant une commutateur +12V
german: Achtung, diese Einstellung sollte nur bei Adaptern mit einem +12V Schalter verwendet werden
italian: Attenzione, questa impostazione dovrebbe essere utilizzata solo con adattatori con un interruttore + 12V
portuguese: Aviso, esta configuração só deve ser usada com adaptadores com uma chave + 12V
russian: Вниманиеб эта настройка испрользуется только на адаптерах с переключателем +12V
spanish: Advertencia, esta configuración solo se debe usar con adaptadores con un interruptor de +12 V

# gui_writing_flash
source: Writing Flash: {0} of {1} bytes ({2}% complete)
chinese: 写入闪存：{0} of {1} 字节（完成{2}%）
french: Ecriture de la Flash: {0} sur {1} bytes ({2}% effectué)
german: Schreibe Flash: {0} von {1} Bytes ({2}% abgeschlossen)
italian: Scrittura Flash: {0} di {1} byte ({2}% completato)
portuguese: Escrevendo Flash: {0} de {1} bytes ({2}% concluído)
russian: Запись Flash: {0} из {1} байт ({2}% завершено)
spanish: Escritura Flash: {0} de {1} bytes ({2}% completado)

# mc_badnand_block
source: BAD NAND BLOCK AT address: 0x{0} (Mapped to 0x{1})
chinese: NAND坏块地址：0x{0}（映像到0x{1}）
french: Mauvais bloc NAND à l’adresse: 0x{0} (Cartographié à 0x{1})
german: Defekter NAND-Block bei: 0x{0} (zugeordnet zu 0x{1})
italian: BLOCCO INVALIDO DELLA NAND ALL' indirizzo: 0x {0} (mappato a 0x {1})
portuguese: BAD NAND BLOCK AT endereço: 0x{0} (Mapped to 0x{1})
russian: BAD NAND BLOCK по адресу: 0x{0} (переназначен на 0x{1})
spanish: BLOQUE NAND MALO EN dirección: 0x {0} (Asignado a 0x{1})

# mc_button_alldata
source: All Data
chinese: 全部数据
french: Conversion d'un fichier binaire au format INTEL HEX
german: Alle Daten
italian: Tutti i dati
portuguese: Todos os dados
russian: Все данные
spanish: Todo Datos

# mc_button_cancel
source: Cancel
chinese: 取消
french: Toute Donnée
german: Abbrechen
italian: Annulla
portuguese: Cancelar
russian: Отмена
spanish: Cancelar

# mc_button_close
source: Close
chinese: 关闭
french: Annulation
german: Schließen
italian: Chiudi
portuguese: Fechar
russian: Закрыть
spanish: Cerrar

# mc_button_compare
source: Compare memory contents
chinese: 比较内存内容
french: Fermer
german: Speicherinhalte vergleichen
italian: Confronta i contenuti della memoria
portuguese: Compare os conteúdos da memória
russian: Сравнить содержимое памяти
spanish: Comparar contenidos de memoria
