Repository: nsq974487195/NAND_flash_test_platform
Catalog: FlashcatUSB/languages/*.resx
Languages: chinese, french, german, italian, portuguese, russian, spanish

# mc_button_erase
source: Erase all memory
chinese: 清除全部内容
french: Compare le contenu de la mémoire
german: Löschen Sie den gesamten Speicher
italian: Cancella tutta la memoria
portuguese: Apague toda a memória
russian: Стереть всю память
spanish: Borrar toda la memoria

# mc_button_main
source: Main
chinese: 主菜单
french: Efface toute la mémoire
german: Hauptbereich
italian: Principale
portuguese: a Principal
russian: Главная
spanish: Principal

# mc_button_ok
source: OK
chinese: 好的
french: Zone Principale
portuguese: Está bem
russian: ОК
spanish: Aceptar

# mc_button_read
source: Read memory to disk
chinese: 内存磁盘读取
french: OK
german: Lese den Speicher aus
italian: Leggi la memoria sul disco
portuguese: Leia a memória no disco
russian: Считать память на диск
spanish: Lee la memoria a un disco

# mc_button_spare
source: Spare
chinese: 备用
french: Lecture de la mémoire vers le disque
german: Spare-Bereich
italian: Riserva
portuguese: Poupar
russian: Запасная
spanish: Reserva

# mc_button_write
source: Write data to memory
chinese: 写入数据到内存
french: Zone de réserve
german: Schreibe Daten in den Speicher
italian: Scrivi i dati nella memoria
portuguese: Escreva dados na memória
russian: Запись данных в память
spanish: Escribir datos a la memoria

# mc_compare_canceled
source: Memory compare canceled
chinese: 内存比较已取消
french: Ecriture de données vers la mémoire
german: Speichervergleich abgebrochen
italian: Confronto di memoria annullato
portuguese: Comparação de memória cancelada
russian: Сравнение памяти отменено
spanish: Comparación de memoria cancelada

# mc_compare_complete_match
source: Memory compare complete: {0}% data match
chinese: 内存比较完成：{0}% 数据匹配
french: Comparaison de la mémoire annulée
german: Speichervergleich abgeschlossen: {0}% Übereinstimmung
italian: Confronto di memoria completato: {0}% corrispondenza dati
portuguese: A comparação de memória é completa: {0}% de correspondência de dados
russian: Сравнение памяти отменено: {0}% совпавших данных
spanish: Comparación de memoria completado: {0}% coincidencia de datos

# mc_compare_complete_tot
source: Memory compare complete: {0} total mismatches ({1}% match)
chinese: 内存比较完成：{0}% 不匹配总数（{1}% 匹配）
french: Comparaison de la mémoire terminée: {0}% de correspondance des données
german: Speichervergleich abgeschlossen: {0} insgesamt nicht übereinstimmend ({1}% Übereinstimmung)
italian: Confronto di memoria completato: {0}% corrispondenza dati…
portuguese: A comparação de memória é completa: {0} desajustes totais ({1}% correspondem)
russian: Сравнение памяти отменено: {0} несовпадений ({1}% совпадений)
spanish: Comparación de memoria completado: {0} total que no coinciden ({1}% coincidencia)

# mc_compare_filename
source: Filename
chinese: 文件名
french: Comparaison de la mémoire terminée: {0} erreurs en tout ({1}% de correspondances)
german: Dateiname
italian: Nome del file
portuguese: Nome do arquivo
russian: Имя файла
spanish: Nombre del archivo

# mc_compare_flash_addr
source: Flash address
chinese: 闪存地址
french: Nom de fichier
german: Flash-Adresse
italian: Indirizzo flash
portuguese: Endereço de flash
russian: Адрес Flash
spanish: Dirección de Flash

# mc_compare_info
source: Flash address: 0x{0}, size: {1} bytes
chinese: 闪存地址：0x{0}， 大小：{1}字节
french: Adresse flash
german: Flash-Adresse: 0x{0}, Größe: {1} Bytes
italian: Indirizzo Flash: 0x {0}, dimensione: {1} byte
portuguese: Endereço do Flash: 0x{0}, tamanho: {1} bytes
russian: Адрес Flash: 0x{0}, размер {1} байт
spanish: Dirección de Flash: 0x{0}, tamaño: {1} bytes

# mc_compare_mismatch
source: Mismatch count: {0} bytes ({1}% match)
chinese: 不匹配数量：{0}字节（{1}%匹配）
french: Adresse flash: 0x{0}, taille: {1} octets
german: Unterschiede: {0} Bytes ({1}% Übereinstimmung)
italian: Conteggio mancata corrispondenza: {0} byte ({1}% corrispondenza)
portuguese: Contagem incompatível: {0} bytes ({1}% correspondência)
russian: Кол-во несовпадений: {0} байт ({1}% совпадений)
spanish: Cuento de desajuste: {0} bytes ({1}% coincidencia)

# mc_compare_results
source: Memory Compare Results
chinese: 内存比较结果
french: Compteur d'erreurs: {0} octets ({1}% de correspondances)
german: Ergebnisse des Speichervergleichs
italian: Confronta i risultati memoria
portuguese: Resultados de comparação de memória
russian: Результат Сравнения Памяти
spanish: Resultados de Comparación de Memoria

# mc_compare_selected
source: File selected, comparing {0}
chinese: 文件已选择，比较中{0}
french: Résultats de la comparaison de mémoire
german: Datei ausgewählt, Vergleiche {0}
italian: File selezionato, confronto {0}
portuguese: Arquivo selecionado, comparando {0}
russian: Файл выбран, сравниваем {0}
spanish: Archivo seleccionado, comparando {0}

# mc_compare_start
source: Beginning memory compare operation
chinese: 开始内存比较操作
french: Fichier sélectionné, comparaison {0}
german: Beginne Speichervergleich
italian: Inizio operazione di confronto della memoria
portuguese: Operação de comparação de memória inicial
russian: Начать процедуру сравнения памяти
spanish: Iniciando operación de comparación de memoria

# mc_compare_total_processed
source: Total bytes processed
chinese: 已处理字节总数
french: Début de l'opération de comparaison mémoire
german: Gesamtzahl der verarbeiteten Bytes
italian: Totale byte elaborati
portuguese: Total de bytes processados
russian: Всего обработано байт
spanish: Total de bytes procesados

# mc_erase_command_sent
source: Sent memory erase command to device: {0}
chinese: 发送内存清除命令到设备：{0}
french: Nombre total d'octets traités
german: Speicherlöschbefehl an Gerät gesendet: {0}
italian: Comando di cancellazione della memoria inviato al dispositivo: {0}
portuguese: Mandar o comando de apagar memória para o dispositivo: {0}
russian: Отправит команду очистки на устройство: {0}
spanish: Enviado comando de borrado de memoria al dispositivo: {0}

# mc_erase_confirm
source: Confirm memory erase of {0}
chinese: 确认内存清除{0}
french: Envoie de la commande d'effacement mémoire au circuit: {0}
german: Speicherlöschung von {0} bestätigen
italian: Conferma la cancellazione della memoria di {0}
portuguese: Confirmar apagar memória de {0}
russian: Подтвердить очистку {0}
spanish: Confirmar borrado de memoria de {0}

# mc_erase_warning
source: This action will permanently delete all data
chinese: 此项操作将会永久删除所有数据
french: Confirmer l'effacement mémoire de {0}
german: Diese Aktion löscht alle Daten endgültig
italian: Questa azione eliminerà definitivamente tutti i dati
portuguese: Esta ação eliminará permanentemente todos os dados
russian: Это действие безвозвратно удалит все данные
spanish: Esta acción eliminará permanentemente todos los datos

# mc_io_destination
source: Target Flash address: 0x{0}, bytes to write: {1} bytes
chinese: 目标闪存地址：0x{0}，写入字节：{1}字节
french: Cette action va effacer le données de façon définitive
german: Ziel-Flash-Adresse: 0x {0}, zu schreibende Bytes: {1} Bytes
italian: Indirizzo Flash target: 0x {0}, byte da scrivere: {1} byte
portuguese: Endereço do Flash de destino: 0x{0}, bytes para escrever: {1} bytes
russian: Целевой адрес Flash: 0x{0}, для записи: {1} байт
spanish: Dirección de destino Flash: 0x{0}, bytes para escribir: {1} bytes

# mc_io_file_cancel_to
source: User canceled. No data written to {0}
chinese: 用户已取消。无写入数据到{0}
french: Adresse ce la cible flash: 0x{0}, octets à écrire: {1} octets
german: Durch Benutzer abgebrochen. Keine Daten auf {0} geschrieben
italian: Azione annullata. Nessun dato scritto in {0}
portuguese: Usuário cancelado. Nenhum dado escrito em {0}
russian: Отменено пользователем. Данные не были записаны на {0}
spanish: Usuario cancelado. Sin datos escritos en {0}

# mc_io_file_choose
source: Choose file to write into {0}
chinese: 选择文件写入到{0}
french: Annulation par l'utilisateur. Aucune donnée écrite sur {0}
german: Wählen Sie die Datei aus, die in {0} geschrieben werden soll
italian: Scegli il file da scrivere in {0}
portuguese: Escolha o arquivo para escrever em {0}
russian: Выбрать файл для записи на {0}
spanish: Elija archivo para escribir en {0}

# mc_io_file_compare
source: Select file to compare with memory
chinese: 选择内存比较文件
french: Choisir le fichier à écrire sur {0}
german: Wählen Sie die Datei aus, die mit dem Speicher verglichen werden soll
italian: Seleziona il file da confrontare con la memoria
portuguese: Selecione o arquivo para comparar com a memória
russian: Выбрать файл для сравнения с памятью
spanish: Seleccionar archivo para comparar con la memoria

# mc_io_file_writing
source: File chosen, writting into {0}
chinese: 文件已选择，写入到{0}
french: Sélectionner le fichier à comparer avec la mémoire
german: Datei ausgewählt, schreibe auf {0}
italian: File scelto, scrivendo in {0}
portuguese: Arquivo escolhido, escrevendo para {0}
russian: Файл выбран, запись на {0}
spanish: Archivo elegido, escribiendo en {0}

# mc_io_open_file
source: Opened file for writing: {0}, (size: {1} bytes)
chinese: 写入文件已打开：{0}（大小：{1}字节）
french: Fichier sélectionné, écriture sur {0}
german: Datei zum Schreiben geöffnet: {0}, (Größe: {1} Bytes)
italian: File aperto per scrittura: {0}, (dimensione: {1} byte)
portuguese: Arquivo aberto para escrita: {0}, (tamanho: {1} bytes)
russian: Файл открыт для записи: {0}, (размер: {1} байт)
spanish: Archivo abierto para escritura: {0}, (tamaño: {1} bytes)

# mc_io_save_canceled
source: User canceled. No data has been saved
chinese: 用户已取消，无保存数据
french: Fichier ouvert pour écriture: {0}, (taille: {1} octets)
german: Durch Benutzer abgebrochen. Es wurden keine Daten gespeichert
italian: Azione annullata. Nessun dato è stato salvato
portuguese: Usuário cancelado. Nenhum dado foi salvo
russian: Отменено пользователем. Данные не были сохранены
spanish: Usuario cancelado. No se han guardado datos

# mc_io_save_type
source: Choose hard drive location and output data format
chinese: 选择数据输出格式和硬盘
french: Annulation par l'utilisateur. Aucune donnée n'a été sauvée.
german: Wählen Sie den Speicherort und das Ausgabedatenformat
italian: Scegli la posizione su disco rigido e il formato dei dati di output
portuguese: Escolha a localização do disco rígido e o formato de dados de saída
russian: Выбрать место на жёстком диске и формат данных
spanish: Elija la ubicación del disco duro y el formato de salida de datos

# mc_mem_read_begin
source: Beginning memory read from {0}
chinese: 从{0}开始内存读取
french: Opération de lecture terminée
german: Beginne mit dem Auslesen des Speichers von {0}
italian: Inizio della memoria letta da {0}
portuguese: Memória de início lida de {0}
russian: Начало чтения памяти с {0}
spanish: Iniciando lectura de memoria de {0}

# mc_mem_read_canceled
source: Read operation canceled
chinese: 读取操作已取消
french: Sélectionner la range pour la lecture des données depuis {0}
german: Lesevorgang abgebrochen
italian: Leggi l'operazione annullata
portuguese: Operação de leitura cancelada
russian: Операция чтения отменена
spanish: Operación de lectura cancelada

# mc_mem_read_done
source: Read operation complete
chinese: 读取操作已完成
french: Fichier ouvert pour écriture: {0} (Intel hex format), Taille totale: {1} octets
german: Lesevorgang abgeschlossen
italian: Leggi l'operazione completata
portuguese: Operação de leitura completa
russian: Операция чтения завершена
spanish: Operación de lectura completado

# mc_mem_read_from
source: Select range to read from {0}
chinese: 从{0}选择读取范围
french: Lu {0} octets en {1} secondes, {2}
german: Wählen Sie den Bereich aus, der von {0} gelesen werden soll
italian: Seleziona l'intervallo da leggere da {0}
portuguese: Selecione o intervalo para ler de {0}
russian: Выбрать область чтения из {0}
spanish: Seleccione rango para leer desde {0}

# mc_mem_read_result
source: Read {0} bytes in {1} seconds, {2}
chinese: 读取{0}字节 {1}秒，{2}
french: Opération de lecture en cours
german: {0} Bytes in {1} Sekunden gelesen, {2}
italian: Leggi {0} byte in {1} secondi, {2}
portuguese: Leia {0} bytes em {1} segundos, {2}
russian: Считано {0} байт за {1} секунд, {2}
spanish: Leyó {0} bytes en {1} segundos, {2}

# mc_mem_read_start
source: Performing memory read operation
chinese: 执行内存读取操作
french: Adresse de début: {0} ({1}) Longueur: {2}
german: Lesevorgang wird durchgeführt
italian: Esecuzione dell'operazione di lettura della memoria
portuguese: Execução de operação de leitura de memória
russian: Выполняется чтение из памяти
spanish: Realizando operación de lectura de memoria

# mc_mem_start_addr
source: Start address: {0} ({1}) Length: {2}
chinese: 起始地址：{0}（{1}）长度：{2}
french: L'utilisateur a annulé l'opération de lecture
german: Anfangsadresse: {0} ({1}) Länge: {2}
italian: Indirizzo iniziale: {0} ({1}) Lunghezza: {2}
portuguese: Endereço de início: {0} ({1}) Comprimento: {2}
russian: Начальный адрес: {0} ({1}) Длинна: {2}
spanish: Dirección de inicio: {0} ({1}) Longitud: {2}

# mc_mem_user_cancel
source: User canceled read operation
chinese: 用户已取消读取操作
french: Données lues converties au format Intel HEX pour enregistrement
german: Benutzer hat Lesevorgang abgebrochen
italian: Operazione di lettura annullata dall'utente
portuguese: Operação de leitura cancelada pelo usuário
russian: Операция чтения отменена пользователем
spanish: Usuario cancelado operación de lectura

# mc_mem_write_success
source: {0} successfully saved to disk
chinese: {0} 成功保存到磁盘
french: {0} enregistré sur le disque avec succès
german: {0} erfolgreich abgespeichert
italian: {0} salvato con successo su disco
portuguese: {0} salvo com sucesso no disco
russian: {0} успешно сохранён на диск
spanish: {0} guardado exitosamente en el disco

# mc_reading
source: Reading: {0} of {1}
chinese: 读取中：{0} of {1}
french: Lecture: {0} sur {1}
german: Lesen: {0} von {1}
italian: Lettura: {0} di {1}
portuguese: Leitura: {0} de {1}
russian: Чтение: {0} из {1}
spanish: Leyendo: {0} de {1}

# mc_rngbox_base
source: Base address
chinese: 基址
french: Adresse de base
german: Basisadresse
italian: Indirizzo base
portuguese: Endereço base
russian: Базовый адрес
spanish: Dirección base

# mc_rngbox_len
source: Length
chinese: 长度
french: Longueur
german: Länge
italian: Lunghezza
portuguese: comprimento
russian: Длинна
spanish: Longitud

# mc_select_range
source: Select range to write data to {0}
chinese: 选择写入数据的范围到{0}
french: Sélectionner la range pour l'écriture des données sur {0}
german: Den Bereich zum Schreiben von Daten in {0} auswählen
italian: Seleziona l'intervallo per scrivere i dati su {0}
portuguese: Selecione o intervalo para gravar dados em {0}
russian: Выбрать область записи в {0}
spanish: Seleccionar rango para escribir datos en {0}

# mc_wr_oper_complete
source: Write operation complete, {0} bytes written
chinese: 完成写入操作，写入{0}字节
french: Opération d'écriture terminée, {0} octets écrits
german: Schreibvorgang abgeschlossen, {0} Bytes geschrieben
italian: Scrivi l'operazione completata, {0} byte scritti
portuguese: A operação de gravação completa, {0} bytes escrito
russian: Операция записи выполнена успешно, записано {0} байт
spanish: Operación de escritura completa, {0} bytes escritos

# mc_wr_oper_failed
source: Write operation was not successful
chinese: 写入操作不成功
french: L'opération d'écriture a échoué
german: Schreibvorgang war nicht erfolgreich
italian: L'operazione di scrittura non ha avuto successo
portuguese: A operação de gravação não foi bem sucedida
russian: Операция записи не выполнена
spanish: La operación de escritura no tuvo éxito

# mc_wr_oper_file_err
source: Error, file does not exist or does not contain data
chinese: 错误：文件不存在或无数据
french: Erreur, le fichier n'existe pas ou ne contient pas de données
german: Fehler, Datei existiert nicht oder enthält keine Daten
italian: Errore, il file non esiste o non contiene dati
portuguese: Erro, o arquivo não existe ou não contém dados
russian: Ошибка, файл не существует или не содержит данных
spanish: Error, el archivo no existe o no contiene datos

# mc_wr_oper_result
source: {0} bytes written in {1} seconds, {2} Bytes/s
chinese: {1}写入{0}字节，{2}字节/秒
french: {0} octets écrits {1} secondes, {2} octets/s
german: {0} Bytes in {1} Sekunden geschrieben, {2} Bytes/s
italian: {0} byte scritti in {1} secondi, {2} byte / s
portuguese: {0} bytes escritos em {1} segundos, {2} Bytes / s
russian: {0} байт записано за {1} секунд, {2} Байт/с
spanish: {0} bytes escritos en {1} segundos, {2} Bytes/s

# mc_wr_oper_start
source: Performing memory write operation
chinese: 执行内存写入操作
french: Opération d'écriture dans la mémoire en cours
german: Schreibvorgang wird durchgeführt
italian: Esecuzione dell'operazione di scrittura della memoria
portuguese: Execução de operação de gravação de memória
russian: Выполняется запись в память
spanish: Realizando operación de escritura de memoria

# mc_wr_oper_status
source: Writing file {0} into {1} ({2} bytes to write)
chinese: 写入文件{0}到{1}（{2}字节写入）
french: Ecriture du fichier {0} sur {1} ({2} octets à écrire)
german: Datei {0} in {1} schreiben ({2} Bytes zum Schreiben)
italian: Scrittura del file {0} in {1} ({2} byte per scrivere)
portuguese: Escrevendo o arquivo {0} em {1} ({2} bytes para escrever)
russian: Запись файла {0} в {1} ({2} байт для записи)
spanish: Escribiendo archivo {0} en {1} ({2} bytes para escribir)

# mc_wr_user_canceled
source: User cancelled write operation
chinese: 用户已取消写入操作
french: Opération d'écriture annulée par l'utilisateur
german: Benutzer hat Schreibvorgang abgebrochen
italian: Operazione di scrittura annullata dall'utente
portuguese: Operação de gravação cancelada pelo usuário
russian: Операция записи отменена пользователем
spanish: Operación de escritura cancelada por el usuario

# mem_verify_data_at
source: Verifing written data at {0}
chinese: 验证写入数据在{0}
french: Vérification des données écrites sur {0}
german: Verifiziere geschriebene Daten bei {0}
italian: Verifica dei dati scritti su {0}
portuguese: Verificando dados escritos em {0}
russian: Проверка записи данных на {0}
spanish: Verificación de datos escritos en {0}

# settings_auto
source: Use automatic settings
chinese: 使用自动设置
french: Sélection des paramètres automatiquement
german: Verwende automatische Einstellungen
italian: Utilizza le impostazioni automatiche
portuguese: Use configurações automáticas
russian: Использовать автоматические настройки
spanish: Utilice ajustes automáticas

# settings_blk_disabled
source: Disabled
chinese: 禁用
french: Invalidé
german: Deaktiviert
italian: Disabilitato
portuguese: Desativado
russian: Отключено
spanish: Deshabilitado

# settings_box_block
source: Bad block manager
chinese: 坏块管理
french: Mauvais gestionnaire de bloc
german: Bad-Block Verwaltung
italian: Gestore blocco errato
portuguese: Gerenciador de bloco ruim
russian: Менеджер повреждённых блоков
spanish: Administrador de bloque malo

# settings_box_general
source: General
chinese: 综合
french: Général
german: Allgemein
italian: Generale
portuguese: Geral
russian: Основные

# settings_box_layout
source: Main/spare area layout
chinese: 主要/备用区域布局
french: Disposition des zones Principale/Réserve
german: Layout des Main/Spare-Bereichs
italian: Layout area principale / di riserva
portuguese: Layout da área principal / sobressalente
russian: Основная/запасная секция
spanish: Esquema de area principal/reserva

# settings_mismatch
source: On write mismatch, write data to next block
chinese: 写入不匹配，在下一个块写入数据
french: Si erreur d'écriture, écrire les données sur le prochain bloc
german: Schreibe die Daten bei Schreibfehlern in den nächsten Block
italian: In caso di mancata corrispondenza della scrittura, scrivere i dati sul blocco successivo
portuguese: Na falta de correspondência de escrita, escreva dados para o próximo bloco
russian: При несовпадении записать данные в следующий блок
spanish: En la discrepancia de escritura, escriba los datos a el bloque siguiente

# settings_preserve_mem
source: Preserve memory areas
chinese: 保存内存区域（如：在主区域写入前复制备用区域）
french: Conserve les zones de mémoire
german: Erhalte Speicherbereiche (d.h. kopiere den Spare-Bereich vor dem Schreibvorgang des Main-Bereichs)
italian: Conserva le aree di memoria (e.s. copia l'area di riserva prima dell'operazione di scrittura dell'area principale)
portuguese: Preserve áreas de memória
russian: Сохранить участки памяти (скопировать в запасную секцию до записи основной)
spanish: Conservar áreas de memoria

# settings_read_cmd
source: Read command
chinese: 读取命令
french: Commande de lecture
german: Lese-Befehl
italian: Comando di lettura
portuguese: Ler comando
russian: Команда чтения
spanish: Comando de lectura

# settings_specify
source: Use these settings
chinese: 自定义设置
french: Utiliser ces paramètres
german: Verwende benutzerdefinierte Einstellungen
italian: Usa queste impostazioni
portuguese: Use estas configurações
russian: Использовать эти настройки
spanish: Utilice estos ajustes

# cfi_flash_base
source: CFI Flash base address: 0x{0}
chinese: CFI闪存基址：0x{0}
french: Adresse de base CFI Flash: 0x{0}
german: Basisadresse des CFI-Flashs: 0x{0}
italian: Indirizzo base CFI Flash : 0x{0}
portuguese: CFI Flash base endereço: 0x{0}
russian: Базовый адрес CFI Flash: 0x{0}
spanish: Dirección de la base de CFI Flash: 0x{0}

# cfi_flash_detected
source: CFI compatible Flash detected at 0x{0}
chinese: 在0x{0}检测到CFI可兼容的闪存
french: Flash compatible CFI détectée sur 0x{0}
german: CFI kompatibler Flash bei 0x{0} erkannt
italian: CFI compatibile Flash inizializzato a 0x{0}
portuguese: CFI compatível Flash detectado em 0x{0}
russian: Обнаружено CFI-совместимое устройство по адресу 0x{0}
spanish: Flash compatible con CFI detectado a 0x{0}

# cfi_flash_failed
source: Failed to detect CFI compatible Flash
chinese: 检测CFI可兼容闪存失败
french: Echec de la détection de flash compatible CFI
german: Erkennen von CFI kompatiblem Flash fehlgeschlagen
italian: Impossibile rilevare Flash compatibile con CFI
portuguese: Falha ao detectar o Flash compatível com CFI
russian: Не удалось обнаружить CFI-совместимое устройство
spanish: Error al detectar Flash compatible con CFI

# cfi_flash_info
source: CFI Flash description: {0} ({1} bytes)
chinese: CFI闪存描述：{0}（{1} 字节）
french: Description flash CFI: {0} ({1} octets)
german: CFI Flash Beschreibung: {0} ({1} Bytes)
italian: Descrizione CFI Flash: {0} ({1} bytes)
portuguese: Descrição do Flash CFI: {0} ({1} bytes)
russian: Описание CFI Flash: {0} ({1} байт)
spanish: Descripción de CFI Flash: {0} ({1} bytes)

# nand_reading_block
source: Reading NAND block {0} of {1} ({2}% complete)
chinese: 读取NAND块{0} of{1}（{2}%完成）
french: Lecture bloc NAND {0} sur {1} ({2}% effectué)
german: Lese NAND-Block {0} von {1} ({2}% abgeschlossen)
italian: Lettura del blocco NAND {0} di {1} ({2}% completato)
portuguese: Leitura do bloco NAND {0} de {1} ({2}% completo)
russian: Считывается NAND блок {0} из {1} ({2}% завершено)
spanish: Leyendo bloque NAND {0} de {1} ({2}% completado)

# settings_combined
source: Combined
chinese: 组合
french: Combiné
german: Kombiniert
italian: Combinato
portuguese: Combinado
russian: Комбинированная
spanish: Combinado

# settings_disable_ecc
source: Disable SPI-NAND ECC generator
chinese: 禁用SPI-NAND ECC生成器
french: Dévalide le générateur ECC SPI-NAND
german: Deaktiviere den SPI-NAND ECC-Generator
italian: Disabilitare il generatore di SPI-NAND ECC
portuguese: Desativar o gerador SPI-NAND ECC
russian: Отключить SPI-NAND ECC генератор
spanish: Deshabilitar generador SPI-NAND ECC

# settings_nand_readverify
source: Use Read-Verify on 'Create Image'
chinese: 在’建立文件’上用读取验证
french: Utilise lecture-vérification lors de la création d'image
german: Verwende die Verifizierung der gelesenen Daten bei der Operation 'Erstelle Speicherabbild'
italian: Usa Read-Verify su 'Crea immagine'
portuguese: Usar Read-Verify em 'Criar imagem'
russian: Использовать чтение с проверкой для команды "Создать образ"
spanish: Utilice Read-Verify en 'Crear imagen'

# settings_segmented
source: Segmented
chinese: 分段
french: Segmenté
german: Segmentiert
italian: segmentato
russian: Сегментированная
spanish: Segmentado
