Repository: nsq974487195/NAND_flash_test_platform
Catalog: FlashcatUSB/languages/*.resx
Languages: chinese, french, german, italian, portuguese, russian, spanish

# AUTHORS
source: Please leave your email address in the comment
chinese: 请在评论处留下您的邮箱
french: Merci de laisser votre adresse email en commentaire
german: Bitte hinterlassen Sie Ihre E-Mail-Adresse als Kommentar
italian: Si prega di lasciare il tuo indirizzo email nel commento
portuguese: Deixe seu endereço de e-mail no comentário
russian: Пожалуйста, оставьте ваш е-мейл в комментарии
spanish: Por favor deje su dirección de correo electrónico en el comentario

# board_fw_version
source: Board firmware version
chinese: 电路板固件版本
french: Version du firmware de la carte
german: Firmware-Version des Boards
italian: Versione firmware scheda
portuguese: Versão do firmware da placa
russian: Версия прошивки платы
spanish: Versión de firmware de la placa

source: Bootloader mode
chinese: 引导装载模式
french: Mode "Bootloader"
german: Modus "Bootloader"
italian: Modalità Bootloader
portuguese: Modo Bootloader
russian: Режим загрузчика
spanish: Modo Bootloader

# connected_bl_mode
source: Connected to FlashcatUSB in bootloader mode
chinese: 连接FlashcatUSB到引导装载模式
french: Connecté au FlashcatUSB en mode "bootloader"
german: Verbunden mit FlashcatUSB im Modus "Bootloader"
italian: Collegato a FlashcatUSB in modalità bootloader
portuguese: Conectado ao FlashcatUSB no modo bootloader
russian: Подключен к FlashcatUSB в режиме загрузчика
spanish: Conectado a FlashcatUSB en modo bootloader

# connected_fw_ver
source: Connected to {0}, firmware version: {1}
chinese: 连接到{0}，固件版本：{1}
french: Connecté à {0}, version firmware: {1}
german: Verbunden mit {0}, Firmware Version: {1}
italian: Connesso a {0}, versione firmware: {1}
portuguese: Conectado a {0}, versão do firmware: {1}
russian: Подключен к {0}, версия прошивки: {1}
spanish: Conectado a {0}, versión de firmware: {1}

# console_complete
source: Application completed
chinese: 运行已完成
french: Application terminée
german: Vorgang abgeschlossen
italian: Operazione completata
portuguese: Aplicação concluída
russian: Приложение завершено
spanish: Solicitud completado

# mem_erasing_device
source: Erasing Flash memory device... (this may take up to 2 minutes)
chinese: 正在擦除闪存设备…（此项操作可能需要2分钟）
french: Effacement en cours de la mémoire Flash... (peut prendre 2 minutes)
german: Lösche Flash-Speicher... (dies kann bis zu 2 Minuten dauern)
italian: Cancellazione del dispositivo di memoria Flash ... (possono essere necessari fino a 2 minuti)
portuguese: Apagar dispositivo de memória flash ... (isso pode levar até 2 minutos)
russian: Очищается устройство Flash памяти...(процесс может занять до 2х минут)
spanish: Borrando dispositivo de memoria Flash... (esto puede demorar hasta 2 minutos)

# console_exescript_req
source: Operation ExecuteScript requires option -FILE to specify which script to run
chinese: 执行脚本操作需要选择—选定要运行的文件脚本
french: L'opération "ExecuteScript" nécessite l'option -FILE pour indiquer quel fichier de script exécuter
german: Die Operation "ExecuteScript" erfordert die Option -FILE, um anzugeben, welches Skript ausgeführt werden soll
italian: L'perazione EseguiScript richiede l'opzione -FILE per specificare quale script eseguire
portuguese: Opção ExecuteScript requer opção -FILE para especificar qual script executar
russian: Для операции ExecuteScript нужна опция -FILE, указывающая на скрипт который необходимо выполнить
spanish: La operación ExecuteScript requiere la opción -FILE para especificar qué script ejecutar

# console_i2c_params
source: I2C parameters: slave-address 0x{0}, offset: 0x{1}, length: {2} bytes
chinese: I2C参数：从机地址 0x{0}, 基址偏移：0x{1}, 长度：{2} 字节
french: Paramètres I2C : adresse esclave 0x{0}, décalage: 0x{1}, longueur: {2} octets
german: I2C-Parameter: Slave-Adresse 0x{0}, Offset: 0x{1}, Länge: {2} Bytes
italian: Parametri I2C: indirizzo-slave 0x{0}, offset: 0x{1}, lunghezza: {2} bytes
portuguese: Parâmetros I2C: endereço escravo 0x{0}, deslocamento: 0x{1}, comprimento: {2} bytes
russian: Параметры I2C: slave-адрес 0x{0}, оффсет: 0x{1}, длинна: {2} байт
spanish: Parámetros I2C: dirección-de-esclavo 0x{0}, offset: 0x{1}, longitud: {2} bytes

# console_i2c_reading
source: Reading data from I2C Flash device: {0} ({1} bytes)
chinese: 从I2C闪存设备读取数据: {0} {1} 字节
french: Lecture des données en provenance du circuit flash I2C: {0} ({1} octets)
german: Lese Daten vom I2C-Flash: {0} ({1} Bytes)
italian: Lettura dei dati dal dispositivo I2C Flash: {0} ({1} byte)
portuguese: Lendo dados do dispositivo Flash I2C: {0} ({1} bytes)
russian: Считывание данных с I2C Flash устройства: {0} ({1} байт)
spanish: Lectura de datos del dispositivo Flash I2C: {0} ({1} bytes)

# console_i2c_saved
source: Saved I2C data to: {0}
chinese: 保存I2C数据到：{0}
french: Enregistrement des données I2C sur: {0}
german: I2C-Daten gespeichert in: {0}
italian: Dati I2C salvati a: {0}
portuguese: Dados I2C salvos para: {0}
russian: Данные с I2C сохранены на: {0}
spanish: Datos I2C guardados en: {0}

# console_i2c_write_error
source: Error: unable to write to I2C EEPROM device
chinese: 错误：I2C EEPROM设备不可写入
french: Erreur: Impossible d'écrire sur l'EEPROM I2C
german: Fehler: Schreiben auf I2C EEPROM nicht möglich
italian: Errore: impossibile scrivere sul dispositivo EEPROM I2C
portuguese: Erro: incapaz de gravar no dispositivo I2C EEPROM
russian: Ошибка: сбой записи на I2C EEPROM устройство
spanish: Error: no se pudo escribir al dispositivo EEPROM I2C

# console_i2c_write_success
source: I2C EEPROM write was successful
chinese: 成功写入I2C EEPROM
french: L'écriture sur l' EEPROM I2C s'est correctement déroulée
german: Schreiben auf I2C EEPROM war erfolgreich
italian: La scrittura EEPROM I2C ha avuto successo
portuguese: A gravação I2C EEPROM foi bem sucedida
russian: Запись на I2C EEPROM завершена успешно
spanish: La escritura I2C EEPROM fue exitosa

# console_i2c_writing
source: Writing data to I2C Flash device: {0} ({1} bytes)
chinese: 数据写入到I2C闪存设备：{0} {1} 字节
french: Ecriture des données sur le circuit flash I2C en cours: {0} ({1} octets)
german: Schreibe Daten auf I2C Flash: {0} ({1} Bytes)
italian: Scrittura dei dati sul dispositivo I2C Flash: {0} ({1} byte)
portuguese: Escrevendo dados no dispositivo Flash I2C: {0} ({1} bytes)
russian: Запись данных на I2C Flash устройство: {0} ({1} байт)
spanish: Escribiendo datos al dispositivo Flash I2C: {0} ({1} bytes)

# console_logappend
source: Append the console text to an existing file
chinese: 附加控制文本到已存在文件
french: Ajoute le texte de la console au fichier texte existant
german: Den Konsolentext einer vorhandenen Datei hinzufügen
italian: Aggiungi il testo della console a un file esistente
portuguese: Anexe o texto do console a um arquivo existente
russian: Прикрепить текст консоли к существующему файлу
spanish: Adjunte el texto de la consola a un archivo existente

# console_mode_not_specified
source: MODE not specified (i.e. -SPI or -I2C)
chinese: 模式未指定（如： -SPI 或者 -I2C）
french: MODE non spécifié (i.e. -SPI ou -I2C)
german: MODE nicht angegeben (d.h. -SPI oder -I2C)
italian: MODALITA' non specificata (e.s. -SPI o -I2C)
portuguese: MODE não especificado (isto é, -SPI ou -I2C)
russian: Режим не определён (-SPI или I2C)
spanish: MODO no especificado (v.g. -SPI o -I2C)

# console_no_fcusb
source: No FlashcatUSB devices connected
chinese: 未连接FlashcatUSB
french: Aucun circuit FlashcatUSB connecté
german: Keine FlashcatUSB-Geräte verbunden
italian: Nessun dispositivo FlashcatUSB connesso
portuguese: Nenhum dispositivo FlashcatUSB conectado
russian: FlashcatUSB устройство не подключено
spanish: No hay dispositivos FlashcatUSB conectados

# console_no_mem_devices
source: Unable to perform any actions because there are no detected memory devices
chinese: 没有检测到存储设备，无法进行任何操作。
french: Impossible d'effectuer toute action car aucun circuit de mémoire n'est détecté
german: Es können keine Aktionen ausgeführt werden, da keine Speichergeräte erkannt wurden
italian: Impossibile eseguire alcuna azione perché non ci sono dispositivi di memoria rilevati
portuguese: Não é possível executar quaisquer ações porque não há dispositivos de memória detectados
russian: Невозможно выполнить операции, так как не подключено ни одно устройство памяти
spanish: No se puede realizar ninguna acción porque no hay dispositivos de memoria detectados

# console_operation_not_specified
source: OPERATION not specified (i.e. -READ or -WRITE)
chinese: 操作未指定 （如： -读取 或者 -写入）
french: OPERATION non spécifiée (i.e. -READ ou -WRITE)
german: OPERATION nicht angegeben (d.h. -READ oder -WRITE)
italian: OPERAZIONE non specificata (e.s. -READ o -WRITE)
portuguese: OPERAÇÃO não especificada (i.e -READ ou -WRITE)
russian: Операция не определена (- READ или -WRITE)
spanish: OPERACIÓN no especificada (v.g. -READ o -WRITE)

# console_opt_addr
source: Specifies the I2C slave address (i.e. 0xA0)
chinese: 指定I2C从址 （如：0xA0）
french: Spécifie l'adresse esclave I2C (i.e. 0xA0)
german: Gibt die I2C Slave-Adresse an (d.h. 0xA0)
italian: Specifica l'indirizzo slave I2C (e.s. 0xA0)
portuguese: Especifica o endereço do escravo I2C (ou seja, 0xA0)
russian: Определяет I2C slave-адрес (например 0хА0)
spanish: Especifica la dirección del esclavo I2C (v.g. 0xA0)

# console_opt_eeprom
source: Specifies a SPI/I2C EEPROM (i.e. M95080 or 24XX64)
chinese: 指定SPI/I2C EEPROM (如：M95080 或者 24XX64)
french: Spécifie une EEPROM SPI/I2C (i.e. M95080 or 24XX64)
german: Gibt einen SPI/I2C-EEPROM an (d.h. M95080 oder 24XX64)
italian: Specifica una EEPROM SPI/I2C (e.s. M95080 o 24XX64)
portuguese: Especifica uma EEPROM SPI / I2C (ou seja, M95080 ou 24XX64)
russian: Определяет SPI/I2C EEPROM (например M95080 или 24XX64)
spanish: Especifica una EEPROM SPI/I2C (v.g. M95080 o 24XX64)

# console_opt_erase
source: Perform a whole memory erase prior to writing data
chinese: 写入数据前，删除将编辑的内容
french: Effectue un effacement de toute la mémoire avant d'écrire les données
german: Führe vor dem Schreiben von Daten eine Speicherlöschung durch
italian: Eseguire una cancellazione completa della memoria prima di scrivere i dati
portuguese: Execute um apagamento total da memória antes de escrever dados
russian: Произвести полную очистку данных до записи
spanish: Realizar una borradura de memoria completa antes de escribir datos

# console_opt_exe
source: Allows you to execute a FlashcatUSB script file (*.fcs)
chinese: 允许执行FlashcatUSB脚本文件(*.fcs)
french: Permet d'exécution d'un fichier script FlashcatUSB (*.fcs)
german: Ermöglicht das Ausführen einer FlashcatUSB-Skriptdatei (*.fcs)
italian: Ti permette di eseguire un file di script FlashcatUSB (* .fcs)
portuguese: Permite que você execute um arquivo de script FlashcatUSB (* .fcs)
russian: Позволяет выполнить FlashcatUSB скрипт (*.fcs)
spanish: Le permite ejecutar un archivo de script FlashcatUSB (*.fcs)

# console_opt_exit
source: Automatically close window when completed
chinese: 完成后自动关闭窗口
french: Ferme automatiquement la fenêtre à la fin
german: Fenster nach Fertigstellung automatisch schließen
italian: Chiudi automaticamente la finestra al termine
portuguese: Fechar automaticamente a janela quando concluída
russian: Автоматически закрыть окно по заврешении
spanish: Cerrar ventana automáticamente cuando se complete

# console_opt_file
source: Specifies the file to use for read/write/execute
chinese: 指定要 读取/写入/执行 的文件
french: Spécifie le fichier à utiliser pour lire/écrire/exécuter
german: Gibt die Datei an, die zum Lesen/Schreiben/Ausführen verwendet werden soll
italian: Specifica il file da utilizzare per lettura / scrittura / esecuzione
portuguese: Especifica o arquivo a ser usado para leitura / gravação / execução
russian: Определяет файл используемый для операций чтения/записи/исполнения
spanish: Especifica el archivo a usar para leer/escribir/ejecutar

# console_opt_help
source: Shows this dialog
chinese: 显示对话框
french: Affiche ce message
german: Zeigt diesen Dialog an
italian: Mostra questa finestra di dialogo
portuguese: Mostra esse diálogo
russian: Показывает этот диалог
spanish: Muestra este diálogo

# console_opt_length
source: Specifies the number of bytes to read/write
chinese: 显示 读取/写入 的字节
french: Spécifie le nombre d'octets à lire/écrire
german: Gibt die Anzahl der zu lesenden/schreibenden Bytes an
italian: Specifica il numero di byte da leggere / scrivere
portuguese: Especifica o número de bytes para ler / escrever
russian: Определяет количество байт для чтения/записи
spanish: Especifica la cantidad de bytes para leer/escribir

# console_opt_list
source: Displays the USB paths for all conneted FlashcatUSB devices
chinese: 显示所有连接FlashcatUSB设备的USB路径
french: Affiche le chemin USB pour tous les circuits FlashcatUSB connectés
german: Zeigt die USB-Pfade für alle angeschlossenen FlashcatUSB-Geräte an
italian: Visualizza i percorsi USB per tutti i dispositivi FlashcatUSB collegati
portuguese: Exibe os caminhos USB para todos os dispositivos FlashcatUSB conectados
russian: Показывает пути USB для всех подключённых устройств FlashcatUSB
spanish: Muestra las rutas USB para todos los dispositivos FlashcatUSB conectados

# console_opt_log
source: Save the output from the console to a file
chinese: 将输出从控制台保存到文件
french: Enregistre les sorties de la console dans un fichier
german: Speichere die Ausgabe der Konsole in eine Datei
italian: Salva l'output dalla console in un file
portuguese: Salve a saída do console em um arquivo
russian: Сохранить вывод консоли в файл
spanish: Guarde el resultado de la consola en un archivo

# console_opt_offset
source: Specifies the offset to write the file to flash
chinese: 指定要将文件写入到闪存的偏移量
french: Spécifie le décalage pour l'écriture du fichier dans la mémoire flash
german: Gibt den Offset für das Schreiben der Datei in den Flash-Speicher an
italian: Specifica l'offset per scrivere il file da flashare
portuguese: Especifica o deslocamento para gravar o arquivo no flash
russian: Указывает оффсет для записи файла на flash-устройство
spanish: Especifica el offset para escribir el archivo en flash

# console_opt_path
source: Select which FlashcatUSB to use (use quotes around path)
chinese: 选择所用的FlashcatUSB（使用引号标注路径）
german: Wählen Sie den zu verwendenden FlashcatUSB (verwenden Sie die Anführungszeichen für den Pfad)
italian: Seleziona quale FlashcatUSB usare (usa le virgolette per il percorso)
portuguese: Selecione o FlashcatUSB para usar (use aspas em torno do caminho)
russian: Выбрать активное устройство FlashcatUSB (путь к устройству должен быть в кавычках)
spanish: Seleccione qué FlashcatUSB usar (use comillas alrededor de la ruta)

# console_opt_read
source: Will perform a flash memory read operation
chinese: 将执行闪存读取操作
french: Effectue une opération de lecture de la mémoire flash
german: Führt eine Flash-Speicher Leseoperation durch
italian: Effettuerà un'operazione di lettura della memoria flash
portuguese: Executa uma operação de leitura de memória flash
russian: Выполняет операцию чтения из flash памяти
spanish: Realizará una operación de lectura de memoria flash

# console_opt_verify
source: Turns off data verification for flash write operations
chinese: 进行闪存写入操作，需关闭数据验证
french: Supprime la vérification après une opération d'écriture sur la mémoire
german: Deaktiviert die Datenverifizierung bei Flash-Speicher Schreiboperationen
italian: Disattiva la verifica dei dati per le operazioni di scrittura flash
portuguese: Desliga a verificação de dados para operações de gravação instantânea
russian: Отключает проверку данных для операций записи на flash
spanish: Desactiva la verificación de datos para las operaciones de escritura flash

# console_opt_write
source: Will perform a flash memory write operation
chinese: 将执行闪存写入操作
french: Effectue une opération d'écriture de la mémoire flash
german: Führt eine Flash-Speicher Schreiboperation durch
italian: Effettuerà un'operazione di scrittura della memoria flash
portuguese: Executa uma operação de gravação de memória flash
russian: Выполняет операцию записи в flash память
spanish: Realizará una operación de escritura de memoria flash

# console_progress
source: [{0}% complete]
chinese: 【完成 {0}%】
french: [{0}% effectué]
german: [{0}% abgeschlossen]
italian: [{0}% completato]
portuguese: [{0}% concluído]
russian: [{0}% завершено]
spanish: [{0}% completado]

# console_readmem_req
source: Operation ReadMemory requires option -FILE to specify where to save to
chinese: 执行读取文件需要 -指定文件存储路径
french: L'opération "ReadMemory" nécessite l'option -FILE pour indiquer dans quel fichier enregistrer les données
german: Die Operation "ReadMemory" erfordert die Option -FILE, um anzugeben, wo die Daten gespeichert werden sollen
italian: L'operazione ReadMemory richiede l'opzione -FILE per specificare dove salvare
portuguese: Operation ReadMemory requer opção -FILE para especificar onde salvar
russian: Для операции ReadMemory нужна опция -FILE, указывающая файл для записи
spanish: La operación ReadMemory requiere la opción -FILE para especificar dónde guardar

# console_read_err_nodata
source: Error: Read was not successful because there is no data to read
chinese: 错误：无数据导致读取不成功！
french: Erreur: La lecture a échoué car il n'y a pas de donnée à lire
german: Fehler: Das Lesen ist fehlgeschlagen, weil keine Daten zu lesen sind
italian: Errore: lettura non andata a buon fine perché non ci sono dati da leggere
portuguese: Erro: Leia não foi bem-sucedido porque não há dados para ler
russian: Ошибка: Операция чтения не выполнена, т.к. отсутствуют данные для чтения
spanish: Error: Lectura no fue exitosa porque no hay datos para leer

# console_usb_list
source: Listing the USB root paths for connected FlashcatUSB devices
chinese: 列出连接FlashcatUSB设备的USB根路径
french: Liste des chemins USB des FlashcatUSB connectés
german: Auflisten der USB-Pfade verbundener FlashcatUSB-Geräte
italian: Elenco dei percorsi root USB per dispositivi FlashcatUSB collegati
portuguese: Listando os caminhos de raiz USB para dispositivos FlashcatUSB conectados
russian: Выводит дерево путей USB устройств для всех подключённых FlashcatUSB
spanish: Enumerar las rutas raíz de USB para dispositivos FlashcatUSB conectados

# console_writemem_req
source: Operation WriteMemory requires option -FILE to specify where to save to
chinese: 执行写入文件需要 -指定文件存储路径
french: L'opération "WriteMemory" nécessite l'option -FILE pour indiquer dans quel fichier enregistrer les données
german: Die Operation "WriteMemory" erfordert die Option -FILE, um anzugeben, wo die Daten gespeichert werden sollen
italian: Operazione WriteMemory richiede l'opzione -FILE per specificare dove salvare
portuguese: Operação WriteMemory requer opção -FILE para especificar onde salvar
russian: Для операции WriteMemory нужна опция -FILE, указывающая файл для cохранения
spanish: La operación WriteMemory requiere la opción -FILE para especificar dónde guardar

# console_write_err_nodata
source: Error: Write was not successful because there is no data to write
chinese: 错误：无数据导致写入不成功！
french: Erreur: L'écriture a échoué car il n'y a pas de donnée à écrire
german: Fehler: Das Schreiben ist fehlgeschlagen, weil keine Daten zu schreiben sind
italian: Errore: la scrittura non è andata a buon fine perché non ci sono dati da scrivere
portuguese: Erro: a gravação não foi bem-sucedida porque não há dados para escrever
russian: Ошибка: Операция записи не выполнена, т.к. отсутствуют данные для записи
spanish: Error: Escritura no fue exitosa porque no hay datos para escribir

# detecting_device
source: Detecting connected Flash device...
chinese: 检测已连接闪存设备…
french: Détection de la mémoire flash connectée en cours
german: Erkenne angebundene Flash-Speicher...
italian: Rilevamento del dispositivo Flash collegato …
portuguese: Detectando o dispositivo Flash conectado ...
russian: Обнаруживаем подключённые Flash устройства…
spanish: Detectando dispositivo Flash conectado...

source: Device mode
chinese: 设备模式
french: Mode du circuit
german: Gerätemodus
italian: Modalità dispositivo
portuguese: Modo dispositivo
russian: Режим устройства
spanish: Modo de dispositivo

# device_mode_i2c
source: Device mode set to I2C EEPROM, configure I2C settings then click 'Detect'
chinese: 设备模式设定I2C EEPROM， 配置I2C设置后点击“检测”
french: Mode EEPROM I2C. Configurer les paramètres I2C puis cliquer 'Détection'
german: Gerätemodus auf I2C EEPROM gesetzt. Konfigurieren Sie die I2C-Einstellungen und klicken Sie auf "Erkennen"
italian: Modalità dispositivo impostata su EEPROM I2C, configura impostazioni I2C quindi fai clic su 'Rileva'
portuguese: Modo de dispositivo configurado para I2C EEPROM, configure as configurações do I2C e clique em 'Detectar'
russian: Выбран режим устройства I2C EEPROM, установите настройки I2C и нажмите "Обнаружить"
spanish: Modo de dispositivo configurado en I2C EEPROM, configure ajustes I2C y luego haga clic en 'Detectar'

# disconnected_from_device
source: Disconnected from {0} device
chinese: 从{0}设备断开
french: Déconnecté du {0} circuit
german: Von Gerät {0} getrennt
italian: Disconnesso dal dispositivo {0}
portuguese: Desconectado do dispositivo {0}
russian: Устройство {0} отключено
spanish: Desconectado del dispositivo {0}

# error_file_not_found
source: Error, file not found: {0}
chinese: 错误：文件未找到：{0}
french: Erreur, fichier non trouvé: {0}
german: Fehler: Datei nicht gefunden: {0}
italian: Errore, file non trovato: {0}
portuguese: Erro, arquivo não encontrado: {0}
russian: Ошибка, файл не найден: {0}
spanish: Error, archivo no encontrado: {0}

# err_file_not_found
source: Error: file not found
chinese: 错误：文件未找到！
french: Erreur, fichier non trouvé
german: Fehler: Datei nicht gefunden
italian: Errore: file non trovato
portuguese: Erro: arquivo não encontrado
russian: Ошибка: файл не найден
spanish: Error: archivo no encontrado

# err_unable_to_connect
source: Error: Unable to connect to FlashcatUSB
chinese: 错误：无法连接到FlashcatUSB
french: Erreur: Impossible de se connecter au FlashcatUSB
german: Fehler: Verbindung zu FlashcatUSB nicht möglich
italian: Errore: impossibile connettersi a FlashcatUSB
portuguese: Erro: não é possível se conectar ao FlashcatUSB
russian: Ошибка: Невозможно подключиться к FlashcatUSB
spanish: Error: no se puede conectar a FlashcatUSB

# ext_4mbit_device
source: DIP32/PLCC32 4MBIT device detected, enabling A18 on Pin 1 (reset)
chinese: 发现设备DIP32/PLCC32 4MBIT, 在Pin 1上启用A18 (重启)
french: Détection d'un circuit DIP32/PLCC32 de 4MBIT, activation de A18 sur la pin 1 (reset)
german: DIP32/PLCC32 4MBIT Gerät erkannt, aktiviere A18 auf Pin 1 (Reset)
italian: Rilevato dispositivo DIP32 / PLCC32 4MBIT, abilitando A18 sul Pin 1 (reset)
portuguese: Dispositivo DIP32 / PLCC32 4MBIT detectado, permitindo a A18 no Pin 1 (reiniciar)
russian: Обнаружено устройство DIP32/PLCC32 4Мбит, включаем A18 на Pin 1 (reset)
spanish: Dispositivo DIP32/PLCC32 4MBIT detectado, habilitando A18 en el Pin 1 (resetar)

# ext_board_initalized
source: EXT I/O board successfully initialized
chinese: EXT I/O 初始化成功
french: La carte EXT I/O a été initialisée correctement
german: EXT I/O Board wurde erfolgreich initialisiert.
italian: Scheda I / O EXT inizializzata correttamente
portuguese: Placa EXT I / O bem sucedida inicializada
russian: Плата EXT I/O успешно инициализирована
spanish: La placa de EXT I/O inicializado exitosamente

# ext_board_not_detected
source: Unable to connect to the Extension I/O board
chinese: 无法连接到 Extension I/O 电路板
french: Impossible de se connecter à la carte d'extension I/O
german: Verbindung zum EXT I/O Board nicht möglich
italian: Impossibile connettersi alla scheda I / O di estensione
portuguese: Não é possível conectar-se à placa de extensão E / S
russian: Невозможно подключиться к плате EXT I/O
spanish: No se puede conectar a la placa de Extension I/O
