Repository: nsq974487195/NAND_flash_test_platform
Catalog: FlashcatUSB/languages/*.resx
Languages: chinese, french, german, italian, portuguese, russian, spanish

# mem_write_successful
source: Write operation was successful
chinese: 写入成功
french: Succès de l'opération d'écriture
german: Schreibvorgang war erfolgreich
italian: L'operazione di scrittura ha avuto successo
portuguese: A operação de gravação foi bem sucedida
russian: Операция записи выполнена успешно
spanish: La operación de escritura fue exitosa

# mem_writing_memory
source: Writing memory with {0} bytes
chinese: 写入内存{0}字节
french: Ecriture de {0} octets en mémoire
german: Schreibe {0} Bytes in Speicher
italian: Scrivere memoria con {0} byte
portuguese: Escrevendo memória com {0} bytes
russian: Запись {0} байт в память
spanish: Escribiendo memoria con {0} bytes

source: NAND block manager disabled
chinese: 禁用NAND块管理
french: Gestionnaire de blocs NAND désactivé
german: NAND Block-Manager deaktiviert
italian: Gestore blocchi NAND disabilitato
portuguese: Gerenciador de bloco NAND desativado
russian: Менеджер блоков NAND отключён
spanish: Administrador de bloque NAND deshabilitado

# nand_erase_failed
source: Error while erasing NAND flash device
chinese: 擦除NAND闪存设备时出错
french: Erreur lors de l'effacement du circuit NAND
german: Fehler beim Löschen des NAND-Flashs
italian: Errore durante la cancellazione del dispositivo flash NAND
portuguese: Erro ao apagar o dispositivo flash NAND
russian: Сбой очистки NAND flash устройства
spanish: Error al borrar dispositivo NAND flash

# nand_erase_successful
source: Successfully erased NAND Flash device
chinese: 成功擦除NAND闪存设备
french: Circuit flash NAND correctement effacé
german: NAND-Flash erfolgreich gelöscht
italian: Dispositivo NAND Flash cancellato con successo
portuguese: Removido com sucesso dispositivo NAND Flash
russian: Очистка NAND flash выполнена успешно
spanish: Se borró exitosamente dispositivo NAND Flash

# nand_mem_device_detected
source: NAND memory device detected, loading valid memory map
chinese: 已检测到NAND内存设备，正在加载有效内存映射
french: Mémoire NAND détectée, chargement de la carte mémoire
german: NAND-Speichergerät erkannt, lade gültige Speicherzuordnung
italian: Rilevato dispositivo di memoria NAND, caricando una mappa di memoria valida
portuguese: Dispositivo de memória NAND detectado, carregando mapa de memória válido
russian: Обнаружено устройство NAND, загружается разметка памяти
spanish: Dispositivo de memoria NAND detectado, cargando un mapa de memoria válido

# nand_mem_map_complete
source: NAND memory map complete: {0} pages available for access
chinese: 完成NAND内存映射：{0}页面可访问
french: Fin du chargement de la carte mémoire NAND: {0} pages disponibles pour accès
german: NAND-Speicherzuordnung abgeschlossen: {0} Pages für den Zugriff verfügbar
italian: Mappa della memoria NAND completa: {0} pagine disponibili per l'accesso
portuguese: Mapa de memória NAND completo: {0} páginas disponíveis para acesso
russian: Разметка NAND памяти завершена: {0} страниц доступно
spanish: Mapa de memoria NAND completo: {0} páginas disponibles para accesar

# nand_mem_map_loading
source: Loading NAND memory map for valid memory
chinese: 加载NAND内存映像到有效存储器
french: Chargement de la carte mémoire NAND valide
german: Lade NAND-Speicherzuordnung für gültigen Speicher
italian: Caricamento della mappa della memoria NAND per memoria valida
portuguese: Carregando o mapa de memória NAND para memória válida
russian: Загрузка разметки NAND для исправной памяти
spanish: Cargando el mapa de memoria NAND para la memoria válida

source: No Flash Detected
chinese: 未检测到闪存
french: Aucune Flash détectée
german: Kein Flash erkannt
italian: Nessun flash rilevato
portuguese: Nenhum flash detectado
russian: Flash не обнаружена
spanish: Flash No Detectado

# spinand_connected
source: Connected to SPI NAND Flash (RDID:{0})
chinese: 连接到SPI NAND（RDID:{0}）
french: Connecté à une SPI NAND Flash (RDID:{0})
german: Mit SPI NAND Flash verbunden (RDID: {0})
italian: Connesso a SPI NAND Flash (RDID: {0})
portuguese: Conectado ao SPI NAND Flash (RDID: {0})
russian: Подключено устройство SPI NAND Flash (RDID:{0})
spanish: Conectado a SPI NAND Flash (RDID:{0})

# spinand_flash_size
source: Flash detected: {0} ({1} bytes)
chinese: 检测到闪存：{0}（{1}字节）
french: Flash détectée: {0} ({1} octets)
german: Flash erkannt: {0} ({1} Bytes)
italian: Rilevato Flash: {0} ({1} byte)
portuguese: Flash detectado: {0} ({1} bytes)
russian: Flash обнаружена: {0} ({1} байт)
spanish: Flash detectado: {0} ({1} bytes)

# spinand_opened_device
source: Successfully opened device in SPI NAND mode
chinese: 在SPI NAND模式成功打开设备
french: Circuit ouvert correctement en mode SPI NAND
german: Gerät im SPI NAND-Modus erfolgreich verbunden
italian: Dispositivo aperto con successo in modalità NAND SPI
portuguese: Dispositivo aberto com sucesso no modo SPI NAND
russian: Устройств успешно открыто в режиме SPI NAND
spanish: Dispositivo abierto exitosamente en modo SPI NAND

# spinand_page_size
source: Flash page size: {0} bytes ({1} bytes extended)
chinese: 闪存页面大小：{0}字节（{1}扩展字节）
french: Taille de la page flash: {0} octets ({1} octets étendu)
german: Flash Page-Größe: {0} Bytes ({1} Bytes erweitert)
italian: Dimensione della pagina Flash: {0} byte ({1} byte estesi)
portuguese: Tamanho da página Flash: {0} bytes ({1} bytes estendidos)
russian: Размер Flash страницы: {0} байт ({1} байт расширенных)
spanish: Tamaño de página Flash: {0} bytes ({1} bytes extendidos)

# spi_attempting_detect
source: Attempting to detect SPI device (auto-detect mode)
chinese: 尝试检测SPI设备（自动检测模式）
french: tentative de détection du circuit SPI (mode de détection automatique)
german: Versuche, das SPI-Gerät zu erkennen (automatischer Erkennungsmodus)
italian: Tentativo di rilevare il dispositivo SPI (modalità di rilevamento automatico)
portuguese: Tentando detectar o dispositivo SPI (modo de detecção automática)
russian: Попытка обнаружить SPI устройство (режим авто-определения)
spanish: Intentando detectar dispositivo SPI (modo detección-automática)

# spi_connected_to_flash_spi
source: Connected to SPI Flash (RDID:{0} REMS:{1})
chinese: 连接到SPI闪存（RDID:{0} REMS:{1}）
french: Connecté à la SPI Flash (RDID:{0} REMS:{1})
german: Verbunden mit SPI Flash (RDID: {0} REMS: {1})
italian: Connesso a SPI Flash (RDID: {0} REMS: {1})
portuguese: Conectado ao SPI Flash (RDID: {0} REMS: {1})
russian: Подключено устройство SPI Flash (RDID:{0} REMS:{1})
spanish: Conectado a SPI Flash (RDID:{0} REMS:{1})

# spi_connected_to_flash_sqi
source: Connected to SQI Flash (RDID:{0})
chinese: 连接到SQI闪存（RDID:{0}）
french: Connecté à la SQI Flash (RDID:{0})
german: Verbunden mit SQI Flash (RDID: {0})
italian: Connesso a SQI Flash (RDID: {0})
portuguese: Conectado ao SQI Flash (RDID: {0})
russian: Подключено устройство SQI Flash (RDID:{0})
spanish: Conectado a SQI Flash (RDID:{0})

# spi_detected_ls_spi
source: Detected SPI Flash on low-speed SPI port
chinese: 在低速SPI端口检测到SPI闪存
french: Circuit SPI Flash détecté sur le port SPI basse vitesse
german: SPI Flash am Low-Speed SPI-Port erkannt
italian: Rilevato SPI Flash sulla porta SPI a bassa velocità
portuguese: Detetou SPI Flash na porta SPI de baixa velocidade
russian: Обнаружено устройство SPI Flash на медленном SPI порту
spanish: Flash SPI detectado en puerto SPI de baja-velocidad

# spi_detected_spi
source: Detected SPI Flash on high-speed SPI port
chinese: 在高速SPI端口检测到SPI闪存
french: Circuit SPI Flash détecté sur le port SPI haute vitesse
german: SPI Flash am High-Speed SPI-Port erkannt
italian: Rilevato SPI Flash sulla porta SPI ad alta velocità
portuguese: Detectou SPI Flash na porta SPI de alta velocidade
russian: Обнаружено устройство SPI Flash на быстром SPI порту
spanish: Flash SPI detectado en puerto SPI de alta-velocidad

# spi_detected_sqi
source: Detected SPI Flash on SQI port
chinese: 在SQI端口检测到SPI闪存
french: Circuit SPI Flash détecté sur le port SQI
german: SPI Flash am SQI-Port erkannt
italian: Rilevato SPI Flash sulla porta SQI
portuguese: Detectou SPI Flash na porta SQI
russian: Обнаружено устройство SPI Flash на SQI порту
spanish: Flash SPI detectado en el puerto SQI

# spi_device_not_found_sqi
source: Device opened in SQI mode but not supported in Flash library
chinese: 设备在SQI模式下已打开，但闪存目录不支持
french: Circuit ouvert en mode SQI mais absent de la bibliothèque flash
german: Gerät wurde im SQI-Modus verbunden, wird aber nicht von der Flash-Bibliothek unterstützt
italian: Dispositivo aperto in modalità SQI ma non supportato nella libreria Flash
portuguese: Dispositivo aberto no modo SQI, mas não suportado na biblioteca Flash
russian: Устройство запущено в SQI режиме, но не поддерживается библиотекой Flash устройств
spanish: Dispositivo abierto en modo SQI pero no es soportada en la biblioteca Flash

# spi_device_opened
source: Successfully opened device in SPI mode
chinese: 在SPI模式成功打开设备
french: Circuit ouvert correctement en mode SPI
german: Gerät im SPI-Modus erfolgreich verbunden
italian: Dispositivo aperto con successo in modalità SPI
portuguese: Dispositivo aberto com sucesso no modo SPI
russian: Устройство успешно запущено в SPI режиме
spanish: Dispositivo abierto exitosamente en modo SPI

# spi_eeprom_cfg
source: Configured to use SPI EEPROM device
chinese: 用SPI EEPROM设备配置
french: Configuré pour utiliser le circuit EEPROM SPI
german: Für die Verwendung von SPI EEPROM konfiguriert
italian: Configurato per utilizzare il dispositivo EEPROM SPI
portuguese: Configurado para usar o dispositivo SPI EEPROM
russian: Устройство SPI EEPROM настроено для использования
spanish: Configurado para usar dispositivo SPI EEPROM

# spi_erase_complete
source: Flash erase complete in {0} seconds
chinese: {0}秒完成闪存擦除
french: Effacement Flash terminé en {0} secondes
german: Löschen des Flash-Speichers in {0} Sekunden abgeschlossen
italian: La cancellazione del flash è completata in {0} secondi
portuguese: Apagar o flash completo em {0} segundos
russian: Очистка Flash выполнена за {0} секунд
spanish: Borrado del flash completado en {0} segundos

# spi_erasing_die
source: Erasing flash die index: {0} ({1} bytes)
chinese: 擦除闪存死亡指数：{0}（{1}字节）
french: Effacement du l'index de la matrice flash: {0} ({1} octets)
german: Lösche Flash-Chip Index: {0} ({1} Bytes)
italian: Cancellazione dell'indice del flash: {0} ({1} byte)
portuguese: Apagar o índice do flash: {0} ({1} bytes)
russian: Очистка индекса Flash чипа: {0} ({1} байт)
spanish: Borrando el índice del dado flash: {0} ({1} bytes)

# spi_erasing_flash_device
source: Erasing entire flash device, total size: {0} bytes (this may take a moment)
chinese: 擦除整个闪存设备，总大小：{0}字节（此项操作可能需要一点时间）
french: Effacement complet du circuit flash, taille totale: {0} octets (cela peut prendre un certain temps)
german: Lösche den gesamten Flash-Speicher, Gesamtgröße: {0} Bytes (dies kann einen Moment dauern)
italian: Cancellazione di tutto il dispositivo flash, dimensione totale: {0} byte (potrebbe volerci un momento)
portuguese: Apagar dispositivo flash inteiro, tamanho total: {0} bytes (isso pode demorar um momento)
russian: Очистка всего Flash устройства, общий размер: {0} байт (это займёт некоторое время)
spanish: Borrado entero del dispositivo flash, tamaño total: {0} bytes (esto puede tomar un momento)

# spi_error_reading
source: SPI: Error reading data from USB port
chinese: SPI：从USB端口读取数据出错
french: SPI: Erreur de lecture de données depuis le port USB
german: SPI: Fehler beim Lesen der Daten vom USB-Port
italian: SPI: errore nella lettura dei dati dalla porta USB
portuguese: SPI: Erro ao ler dados da porta USB
russian: SPI: ошибка чтения данных с USB порта
spanish: SPI: Error al leer datos del puerto USB

# spi_error_writing
source: SPI: Error writing data to USB port
chinese: SPI：写入数据到USB端口出错
french: SPI: Erreur d'écriture de données depuis le port USB
german: SPI: Fehler beim Schreiben von Daten auf den USB-Port
italian: SPI: errore durante la scrittura dei dati sulla porta USB
portuguese: SPI: Erro ao escrever dados na porta USB
russian: SPI: ошибка записи данных на USB порт
spanish: SPI: error al escribir datos en el puerto USB

# spi_flash_not_detected
source: Unable to detect compatible SPI device
chinese: 无法检测可兼容的SPI设备
french: Impossible de détecter un circuit SPI compatible
german: Es konnte kein kompatibles SPI-Gerät erkannt werden
italian: Impossibile rilevare il dispositivo SPI compatibile
portuguese: Não é possível detectar o dispositivo SPI compatível
russian: Невозможно обнаружить совместимое SPI устройство
spanish: No se pudo detectar un dispositivo SPI compatible

# spi_flash_page_size
source: Page erase size: {0} bytes
chinese: 页面擦除大小：{0}字节
french: Effacement de page taille: {0} octets
german: Page Löschgröße: {0} Bytes
italian: Dimensione della pagina cancellata: {0} byte
portuguese: Tamanho da eliminação da página: {0} bytes
russian: Размер стираемой страницы: {0} байт
spanish: Tamaño de borrado de página: {0} bytes

# spi_mode_sqi
source: Programming mode: SQI (SPI-QUAD)
chinese: 编程模式：SQI（SPI-QUAD）
french: Mode de programmation: SQI (SPI-QUAD)
german: Programmiermodus: SQI (SPI-QUAD)
italian: Modalità di programmazione: SQI (SPI-QUAD)
portuguese: Modo de programação: SQI (SPI-QUAD)
russian: Режим программирования: SQI (SPI-QUAD)
spanish: Modo de programación: SQI (SPI-QUAD)

# spi_nand_attempt_detect
source: Attempting to detect SPI NAND device
chinese: 尝试检测SPI NAND设备
french: Tentative de détection d'un circuit SPI NAND
german: Versuche SPI NAND Flash zu erkennen
italian: Tentativo di rilevare il dispositivo SPI NAND
portuguese: Tentando detectar o dispositivo SPI NAND
russian: Попытка обнаружить SPI NAND устройство
spanish: Intentando detectar dispositivo SPI NAND

# spi_nand_detected
source: Successfully detected SPI NAND Flash device
chinese: 成功检测到SPI NAND
french: Circuit SPI NAND Flash détecté avec succès
german: SPI NAND Flash wurde erfolgreich erkannt
italian: Dispositivo Flash SPI NAND rilevato con successo
portuguese: Detectado com sucesso o dispositivo SPI NAND Flash
russian: Успешно обнаружено SPI NAND Flash устройство
spanish: Detectado exitosamente dispositivo SPI NAND Flash

# spi_nand_unable_to_detect
source: Unable to detect SPI NAND Flash device
chinese: 无法检测SPI NAND
french: Impossible de détecter le circuit SPI NAND
german: SPI NAND Flash konnte nicht erkannt werden
italian: Impossibile rilevare il dispositivo Flash NAND SPI
portuguese: Não foi possível detectar o dispositivo SPI NAND Flash
russian: Невозможно обнаружить SPI NAND Flash устройство
spanish: No se pudo detectar dispositivo SPI NAND Flash

# spi_not_detected
source: Flash memory not detected on SPI NOR mode
chinese: 未在SPI NOR模式检测到闪存
french: Mémoire flash non détectée en mode SPI NOR
german: Flash-Speicher wurde im Modus 'SPI NOR' nicht erkannt
italian: Memoria flash non rilevata in modalità SPI NOR
portuguese: Memória flash não detectada no modo SPI NOR
russian: Flash память не обнаружена в режиме SPI NOR
spanish: Memoria flash no detectada en el modo SPI NOR

# spi_set_clock
source: Setting SPI clock to: {0}
chinese: 设置SPI时钟为：{0}
french: Valeur de l'horloge SPI: {0}
german: Setze die SPI Clock auf: {0}
italian: Impostazione dell'orologio SPI su: {0}
portuguese: Configurando o relógio SPI para: {0}
russian: Устанавливаем частоту SPI: {0}
spanish: Configurando el SPI clock a: {0}

# spi_successfully_opened_sqi
source: Successfully opened device in SQI mode
chinese: 在SQI模式成功打开设备
french: Circuit ouvert avec succès en mode SQI
german: Gerät im SQI-Modus erfolgreich verbunden
italian: Dispositivo aperto con successo in modalità SQI
portuguese: Dispositivo aberto com sucesso no modo SQI
russian: Устройство успешно запущено в SQI режиме
spanish: Se abrió dispositivo exitosamente en modo SQI

# spi_unable_detect
source: Unable to detect to SPI NOR Flash device
chinese: 无法检测到SPI NOR
french: Impossible de détecteur un circuit SPI NOR
german: Nicht in der Lage, SPI NOR Flash zu erkennen
italian: Impossibile rilevare sul dispositivo Flash SPI NOR
portuguese: Não é possível detectar o dispositivo SPI NOR Flash
russian: Невозможно обнаружить SPI NOR Flash устройство
spanish: No se pudo detectar dispositivo SPI NOR Flash

# successfully_connected
source: Successfully connected to FlashcatUSB over USB
chinese: 成功连接到FlashcatUSB
french: FlashcatUSB connecté avec succès sur port USB
german: Erfolgreich über USB mit FlashcatUSB verbunden
italian: Collegato correttamente a FlashcatUSB tramite USB
portuguese: Conectado com sucesso ao FlashcatUSB por USB
russian: FlashcatUSB устройство успешно подключено через USB
spanish: Conectado exitosamente a FlashcatUSB por USB

# sw_requires_fw
source: Software requires firmware version {0}
chinese: 软件需要{0}或更新的固件版本
french: Le logiciel nécessite la version {0} du firmware
german: Die Software benötigt die Firmware-Version {0}
italian: Il software richiede la versione del firmware {0}
portuguese: O software requer a versão do firmware {0} ou mais recente
russian: Программа требует версию прошивки {0} или выше
spanish: El software requiere la versión de firmware {0} o más nuevo

# unknown_device_email
source: For device support email contact@embeddedcomputers.net with the DEVICE ID
chinese: 设备支持请邮件至：contact@embeddedcomputers.net （包括您的芯片ID）
french: Pour compatibilité avec ce circuit contacter contact@embeddedcomputers.net en indiquant le CHIP ID
german: Zur Unterstützung eines Chips senden Sie eine E-Mail an contact@embeddedcomputers.net mit der entsprechenden CHIP ID
italian: Per l'e-mail di supporto del dispositivo contact@embeddedcomputers.net con DEVICE ID
portuguese: Para suporte de dispositivo, envie um email para contact@embeddedcomputers.net com o ID CHIP
russian: Для поддержки устройства отправьте сообщение на contact@embeddedcomputers.net с идентификатором чипа
spanish: Para soporte de dispositivo enviar correo electrónico a contact@embeddedcomputers.net con el ID de CHIP.

# usb_driver_out_of_date
source: Your FlashcatUSB driver is out of date, please update your driver to the newest version included in this software release
chinese: 您的FlashcatUSB驱动已过期，请更新至最新版本。
french: Votre driver FlashcatUSB est obsolète. Merci de mettre à jour votre driver avec la version plus récente incluse avec cette distribution du logiciel
german: Ihr FlashcatUSB-Treiber ist veraltet, bitte aktualisieren Sie Ihren Treiber auf die neueste Version, die in dieser Softwareversion enthalten ist
italian: Il tuo driver FlashcatUSB non è aggiornato, aggiorna il driver alla versione più recente inclusa in questa versione del software
portuguese: Seu driver FlashcatUSB está desatualizado, atualize seu driver para a versão mais recente incluída nesta versão do software
russian: Драйвер FlashcatUSB устарел, пожалуйста обновите его до версии включённой в этот релиз
spanish: Su controlador FlashcatUSB no está actualizado, actualice su controlador a la última versión incluida en este lanzamiento de software

# usb_firm_out_of_date
source: Your FlashcatUSB firmware is out of date, please update to the version included in this software release
chinese: 您的FlashcatUSB固件已过期，请更新至最新版本。
french: Votre firmware FlashcatUSB est obsolète, merci de le mettre à jour avec la version incluse avec cette distribution du logiciel
german: Ihre FlashcatUSB-Firmware ist veraltet, bitte aktualisieren Sie diese auf die in dieser Softwareversion enthaltene Version
italian: Il tuo firmware FlashcatUSB non è aggiornato, aggiorna la versione inclusa in questa versione del software
portuguese: Seu firmware FlashcatUSB está desatualizado, atualize a versão incluída nesta versão do software
russian: Прошивка FlashcatUSB устарела, пожалуйста обновите её до версии включённой в этот релиз
spanish: Su firmware FlashcatUSB no está actualizado, actualice a la versión incluida en este lanzamiento de software

# voltage_set_to
source: Voltage set to: {0}
chinese: 电压设置为：{0}
french: Tension sélectionnée: {0}
german: Ausgewählte Spannung: {0}
italian: Voltaggio impostato su: {0}
portuguese: Tensão ajustada para: {0}
russian: Вольтаж установлен на: {0}
spanish: Voltaje fijado en: {0}

# welcome_to_flashcatusb
source: Welcome to the FlashcatUSB interfacing software
chinese: 欢迎使用FlashcatUSB界面软件
french: Bienvenue sur le logiciel d'interfaçage du FlashcatUSB
german: Willkommen bei der FlashcatUSB-Schnittstellensoftware
italian: Benvenuti nell'interfaccia del programma FlashcatUSB
portuguese: Bem-vindo ao software de interface FlashcatUSB
russian: Добро пожаловать в программу интерфейса FlashcatUSB
spanish: Bienvenido al software de interfaz FlashcatUSB

# gui_active_script
source: Active script
chinese: 激活脚本
german: Aktives Skript
italian: Script attivo
portuguese: Script ativo
russian: Активный скрипт
spanish: Script activo

# gui_compressed_img
source: Compressed File Archive
chinese: 压缩文件存档
french: Fichier d'archive compressé
german: Komprimierte Archivdatei
italian: Archivio file compresso
portuguese: Arquivo de arquivos compactados
russian: Сжатый Архивный Файл
spanish: Archivo comprimido

# gui_console_text_copied
source: Console text copied to the clipboard
chinese: 控制台文本复制到剪贴板
french: Texte de la console copié dans le presse papier
german: Konsolentext wurde in die Zwischenablage kopiert
italian: Testo della console copiato negli appunti
portuguese: Texto do console copiado para a área de transferência
russian: Текст консоли скопирован в буфер обмена
spanish: Texto de consola copiado en el portapapeles

# gui_creating_nand_file
source: Creating NAND Flash Image file
chinese: 从NAND建立映像文件
french: Création d'un fichier de l'image du NAND flash
german: Erstelle ein Speicherabbild des NAND-Flashs
italian: Creazione di file immagine Flash NAND
portuguese: Criando arquivo de imagem flash NAND
russian: Создаётся файл образа NAND Flash
spanish: Creando archivo de imagen NAND Flash

# gui_database_supported
source: {0} database loaded: {1} devices supported
chinese: 加载数据库：{1}支持的设备
french: {0} base de donnée chargée: {1} circuits compatibles
german: {0} Datenbank geladen: {1} Geräte werden unterstützt
italian: {0} database caricato: {1} dispositivi supportati
portuguese: {0} banco de dados carregado: {1} dispositivos suportados
russian: {0} база загружена: {1} поддерживаемых устройств
spanish: {0} base de datos cargada: {1} dispositivos compatibles

# gui_fcusb_connected
source: FlashcatUSB status: Connected
chinese: FlashcatUSB状态：已连接
french: FlashcatUSB statut: Connecté
german: FlashcatUSB Status: Verbunden
italian: Stato FlashcatUSB: connesso
portuguese: Estado FlashcatUSB: conectado
russian: Статус FlashcatUSB: Подключено
spanish: Estado FlashcatUSB: Conectado

# gui_fcusb_connected_multi
source: FlashcatUSB status: Connected ({0} devices)
chinese: FlashcatUSB状态：已连接({0}设备）
french: FlashcatUSB statut: Connecté à ({0} circuits)
german: FlashcatUSB Status: Verbunden ({0} Geräte)
italian: Stato FlashcatUSB: connesso ({0} dispositivi)
portuguese: Status FlashcatUSB: conectados ({0} dispositivos)
russian: Статус FlashcatUSB: Подключено ({0} устройств)
spanish: Estado de FlashcatUSB: Conectado ({0} dispositivos)

# gui_fcusb_disconnected
source: FlashcatUSB status: Disconnected
chinese: FlashcatUSB状态：未连接
french: FlashcatUSB statut: Déconnecté
german: FlashcatUSB Status: Getrennt
italian: Stato FlashcatUSB: disconnesso
portuguese: Estado FlashcatUSB: desconectado
russian: Статус FlashcatUSB: Отключено
spanish: Estado de FlashcatUSB: Desconectado

# gui_fcusb_new_device
source: New device connected: {0}
chinese: 连接到新设备：{0}
french: Nouveau circuit connecté: {0}
german: Neues Gerät verbunden: {0}
italian: Nuovo dispositivo connesso: {0}
portuguese: Novo dispositivo conectado: {0}
russian: Подключено новое устройство: {0}
spanish: Nuevo dispositivo conectado: {0}
